[
    {
        "instruction": "请提供银翘解毒片的禁用信息",
        "input": "",
        "output": "match (n:药品 { name: '银翘解毒片' }) return n.taboo;"
    },
    {
        "instruction": "能否列举心痛宁滴丸的主要特征？",
        "input": "",
        "output": "match (n:药品 { name: '心痛宁滴丸' }) return n.character;"
    },
    {
        "instruction": "我想了解消咳喘糖浆的包装大小和形式",
        "input": "",
        "output": "match (n:药品 { name: '消咳喘糖浆' }) return n.specifications;"
    },
    {
        "instruction": "请求提供3条药材数据",
        "input": "",
        "output": "match (n:药材) return n limit 3;"
    },
    {
        "instruction": "调经化瘀丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '调经化瘀丸' }) return n.specifications;"
    },
    {
        "instruction": "描述一下再造丸的特性信息",
        "input": "",
        "output": "match (n:药品 { name: '再造丸' }) return n.character;"
    },
    {
        "instruction": "请提供防风通圣丸的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '防风通圣丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "我想了解加味逍遥丸的包装规格是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '加味逍遥丸' }) return n.specifications;"
    },
    {
        "instruction": "请求查询并提供8条辅料的数据",
        "input": "",
        "output": "match (n:辅料) return n limit 8;"
    },
    {
        "instruction": "阐述补肾益脑胶囊的主要特性",
        "input": "",
        "output": "match (n:药品 { name: '补肾益脑胶囊' }) return n.character;"
    },
    {
        "instruction": "参苓白术丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '参苓白术丸' }) return n.specifications;"
    },
    {
        "instruction": "请求8条三核九翼的种类信息数据",
        "input": "",
        "output": "match (n:三核九翼) return n limit 8;"
    },
    {
        "instruction": "蟾麝救心丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '蟾麝救心丸' }) return n.specifications;"
    },
    {
        "instruction": "我想了解孕妇金花丸的包装大小和规格",
        "input": "",
        "output": "match (n:药品 { name: '孕妇金花丸' }) return n.specifications;"
    },
    {
        "instruction": "请阐述内消瘰疬丸的主要作用，同时给出其他具有类似作用的药品名。",
        "input": "",
        "output": "match (n:药品 { name: '内消瘰疬丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "人参养荣丸有什么作用？类似效果的药品还有哪些？请列举一些。",
        "input": "",
        "output": "match (n:药品 { name: '人参养荣丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请提供追风活络酒的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '追风活络酒' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "女金糖浆有哪些功效？类似作用的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '女金糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "在哪些药品的配方中包含三棱？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '三棱'} ) return  n"
    },
    {
        "instruction": "鱼腥草可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '鱼腥草'} ) return  n"
    },
    {
        "instruction": "请给出通脉滴丸特征描述的相关内容。",
        "input": "",
        "output": "match (n:药品 { name: '通脉滴丸' }) return n.character;"
    },
    {
        "instruction": "获取完整的8条中国系列分类信息",
        "input": "",
        "output": "match (n:中国系列) return n limit 8;"
    },
    {
        "instruction": "请求查询并提供4条三核九翼种类的信息",
        "input": "",
        "output": "match (n:三核九翼) return n limit 4;"
    },
    {
        "instruction": "给出小活络片的详细特征",
        "input": "",
        "output": "match (n:药品 { name: '小活络片' }) return n.character;"
    },
    {
        "instruction": "能否告知附子理中丸的包装详情",
        "input": "",
        "output": "match (n:药品 { name: '附子理中丸' }) return n.specifications;"
    },
    {
        "instruction": "固肠胶囊的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '固肠胶囊' }) return n.specifications;"
    },
    {
        "instruction": "请提供关于清凉油的特性描述。",
        "input": "",
        "output": "match (n:药品 { name: '清凉油' }) return n.character;"
    },
    {
        "instruction": "我想了解十全大补糖浆的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '十全大补糖浆' }) return n.specifications;"
    },
    {
        "instruction": "描述一下人参鹿茸丸的特性详情",
        "input": "",
        "output": "match (n:药品 { name: '人参鹿茸丸' }) return n.character;"
    },
    {
        "instruction": "能否列举藿香正气软胶囊的主要特点？",
        "input": "",
        "output": "match (n:药品 { name: '藿香正气软胶囊' }) return n.character;"
    },
    {
        "instruction": "脑立清丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '脑立清丸' }) return n.specifications;"
    },
    {
        "instruction": "癃清片的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '癃清片'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "解析解肌宁嗽片的特征信息",
        "input": "",
        "output": "match (n:药品 { name: '解肌宁嗽片' }) return n.character;"
    },
    {
        "instruction": "整理后的12条辅料数据",
        "input": "",
        "output": "match (n:辅料) return n limit 12;"
    },
    {
        "instruction": "请提供关于小儿琥珀丸的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '小儿琥珀丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "详细描述一下人参再造丸的信息",
        "input": "",
        "output": "match (n:药品  { name: '人参再造丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "描述一下百花定喘丸的特征和属性",
        "input": "",
        "output": "match (n:药品 { name: '百花定喘丸' }) return n.character;"
    },
    {
        "instruction": "请阐述连翘败毒片的功效，并给出其他具有类似疗效的药品名例举。",
        "input": "",
        "output": "match (n:药品 { name: '连翘败毒片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "我希望了解一下豨莶液的特征详情",
        "input": "",
        "output": "match (n:药品 { name: '豨莶液' }) return n.character;"
    },
    {
        "instruction": "全面介绍木香分气丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '木香分气丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "全面阐述百补增力丸的资料",
        "input": "",
        "output": "match (n:药品  { name: '百补增力丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "提供关于舒肝片的特性详情",
        "input": "",
        "output": "match (n:药品 { name: '舒肝片' }) return n.character;"
    },
    {
        "instruction": "请提供止带片的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '止带片' }) return n.specifications;"
    },
    {
        "instruction": "请阐述一下藿香正气水的药品功能，并给出其他具有类似药效的药品名",
        "input": "",
        "output": "match (n:药品 { name: '藿香正气水' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下紫龙金片的功效，同时提供一些具有类似效果的药品名作为参考。",
        "input": "",
        "output": "match (n:药品 { name: '紫龙金片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请查收牛黄解毒丸的特征信息",
        "input": "",
        "output": "match (n:药品 { name: '牛黄解毒丸' }) return n.character;"
    },
    {
        "instruction": "讨论一下豨莶片的药理作用，还有哪些药品在这方面表现相似？",
        "input": "",
        "output": "match (n:药品 { name: '豨莶片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "为分析准备3条三核九翼种类的数据",
        "input": "",
        "output": "match (n:三核九翼) return n limit 3;"
    },
    {
        "instruction": "请提供十香返生丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '十香返生丸' }) return n.specifications;"
    },
    {
        "instruction": "提供关于紫龙金片的特征描述",
        "input": "",
        "output": "match (n:药品 { name: '紫龙金片' }) return n.character;"
    },
    {
        "instruction": "我想了解西羚丹的包装规格情况",
        "input": "",
        "output": "match (n:药品 { name: '西羚丹' }) return n.specifications;"
    },
    {
        "instruction": "请提供散风活血膏的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '散风活血膏' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请描述一下耳聋通窍丸的主要作用，还有其他什么药品有类似效果？",
        "input": "",
        "output": "match (n:药品 { name: '耳聋通窍丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "我想了解关于杞菊地黄丸的完整资料，能提供吗？",
        "input": "",
        "output": "match (n:药品  { name: '杞菊地黄丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "全面阐述人参归脾丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '人参归脾丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "海马补肾丸的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '海马补肾丸' }) return n.character;"
    },
    {
        "instruction": "请列举百花定喘片的主要属性。",
        "input": "",
        "output": "match (n:药品 { name: '百花定喘片' }) return n.character;"
    },
    {
        "instruction": "止痛水的特征信息能否给出几个要点",
        "input": "",
        "output": "match (n:药品 { name: '止痛水' }) return n.character;"
    },
    {
        "instruction": "关于六味地黄片，我需要你提供其主要特征和详细信息。",
        "input": "",
        "output": "match (n:药品 { name: '六味地黄片' }) return n.character;"
    },
    {
        "instruction": "请给出狗皮膏的特性信息，以便我更好地了解它。",
        "input": "",
        "output": "match (n:药品 { name: '狗皮膏' }) return n.character;"
    },
    {
        "instruction": "参茸酒的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '参茸酒' }) return n.specifications;"
    },
    {
        "instruction": "能否告知小活络丸的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '小活络丸' }) return n.specifications;"
    },
    {
        "instruction": "请问长城感冒片有什么治疗效果？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '长城感冒片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "获取6条三核九翼种类的数据样本",
        "input": "",
        "output": "match (n:三核九翼) return n limit 6;"
    },
    {
        "instruction": "能否告知清凉油的包装规格？",
        "input": "",
        "output": "match (n:药品 { name: '清凉油' }) return n.specifications;"
    },
    {
        "instruction": "能否介绍一下清眩软胶囊的功效？类似作用的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '清眩软胶囊' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说一下清眩软胶囊的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '清眩软胶囊' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请提供关于天麻丸的注意事项。",
        "input": "",
        "output": "match (n:药品 { name: '天麻丸' }) return n.note;"
    },
    {
        "instruction": "请提供宽中顺气丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '宽中顺气丸' }) return n.specifications;"
    },
    {
        "instruction": "详细描述银翘解毒片的全部详情",
        "input": "",
        "output": "match (n:药品  { name: '银翘解毒片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "我希望了解清热丸的特征详情",
        "input": "",
        "output": "match (n:药品 { name: '清热丸' }) return n.character;"
    },
    {
        "instruction": "请提供复方百部止咳糖浆的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '复方百部止咳糖浆' }) return n.specifications;"
    },
    {
        "instruction": "请提供橘半枳术丸的详细特征。",
        "input": "",
        "output": "match (n:药品 { name: '橘半枳术丸' }) return n.character;"
    },
    {
        "instruction": "能否告知搜风顺气丸的禁用注意事项？",
        "input": "",
        "output": "match (n:药品 { name: '搜风顺气丸' }) return n.taboo;"
    },
    {
        "instruction": "麦芽(焦)可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '麦芽(焦)'} ) return  n"
    },
    {
        "instruction": "调经丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '调经丸' }) return n.specifications;"
    },
    {
        "instruction": "获取关于辅料的14条数据信息",
        "input": "",
        "output": "match (n:辅料) return n limit 14;"
    },
    {
        "instruction": "全面介绍参苓白术丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '参苓白术丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "我想了解健脾片的包装规格是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '健脾片' }) return n.specifications;"
    },
    {
        "instruction": "请提供京万红软膏的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '京万红软膏' }) return n.specifications;"
    },
    {
        "instruction": "请列举二至丸的主要特点和信息。",
        "input": "",
        "output": "match (n:药品 { name: '二至丸' }) return n.character;"
    },
    {
        "instruction": "我想了解银翘解毒丸的包装大小和规格",
        "input": "",
        "output": "match (n:药品 { name: '银翘解毒丸' }) return n.specifications;"
    },
    {
        "instruction": "请提供关于定喘膏的详细特征描述。",
        "input": "",
        "output": "match (n:药品 { name: '定喘膏' }) return n.character;"
    },
    {
        "instruction": "香砂枳术丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '香砂枳术丸' }) return n.specifications;"
    },
    {
        "instruction": "请提供关于跌打片的详细特征描述。",
        "input": "",
        "output": "match (n:药品 { name: '跌打片' }) return n.character;"
    },
    {
        "instruction": "查询药材，请求10个数据案例",
        "input": "",
        "output": "match (n:药材) return n limit 10;"
    },
    {
        "instruction": "止嗽定喘口服液的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '止嗽定喘口服液' }) return n.character;"
    },
    {
        "instruction": "我想了解橘红化痰丸的包装大小和规格",
        "input": "",
        "output": "match (n:药品 { name: '橘红化痰丸' }) return n.specifications;"
    },
    {
        "instruction": "推荐一些治疗癌肿的药品。",
        "input": "",
        "output": "match (n:药品)-[r:适应症状]->(m :症状 { name : '癌肿' }) return   n ;"
    },
    {
        "instruction": "请提供左金丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '左金丸' }) return n.specifications;"
    },
    {
        "instruction": "关于七制香附丸，能否提供其主要特征和信息？",
        "input": "",
        "output": "match (n:药品 { name: '七制香附丸' }) return n.character;"
    },
    {
        "instruction": "能否告知香砂六君丸的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '香砂六君丸' }) return n.specifications;"
    },
    {
        "instruction": "讨论一下蒲地蓝消炎片的功效，同时列举几个具有类似药效的药品",
        "input": "",
        "output": "match (n:药品 { name: '蒲地蓝消炎片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请提供金芪降糖片的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '金芪降糖片' }) return n.specifications;"
    },
    {
        "instruction": "我希望了解大活络丸的特征详情",
        "input": "",
        "output": "match (n:药品 { name: '大活络丸' }) return n.character;"
    },
    {
        "instruction": "能否提供康尔心胶囊的规格信息？",
        "input": "",
        "output": "match (n:药品 { name: '康尔心胶囊' }) return n.specifications;"
    },
    {
        "instruction": "能详细说说黑锡丹药品的作用吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '黑锡丹' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "希望获得13条药材的数据查询结果",
        "input": "",
        "output": "match (n:药材) return n limit 13;"
    },
    {
        "instruction": "描述健胃宽胸丸的主要特征",
        "input": "",
        "output": "match (n:药品 { name: '健胃宽胸丸' }) return n.character;"
    },
    {
        "instruction": "需要13条药品数据样本",
        "input": "",
        "output": "match (n:药品) return n limit 13;"
    },
    {
        "instruction": "我想了解舟车丸的包装情况，能否提供相关规格？",
        "input": "",
        "output": "match (n:药品 { name: '舟车丸' }) return n.specifications;"
    },
    {
        "instruction": "万氏牛黄清心丸的信息如下：",
        "input": "",
        "output": "match (n:药品  { name: '万氏牛黄清心丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请问银翘解毒颗粒的包装规格是怎样的？",
        "input": "",
        "output": "match (n:药品 { name: '银翘解毒颗粒' }) return n.specifications;"
    },
    {
        "instruction": "以下是安神补气丸的全部详情：",
        "input": "",
        "output": "match (n:药品  { name: '安神补气丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "精制冠心片的特性描述有哪些？",
        "input": "",
        "output": "match (n:药品 { name: '精制冠心片' }) return n.character;"
    },
    {
        "instruction": "请提供11条药品数据例子",
        "input": "",
        "output": "match (n:药品) return n limit 11;"
    },
    {
        "instruction": "请提供化毒丹的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '化毒丹' }) return n.specifications;"
    },
    {
        "instruction": "哪些药品可以使用生姜汁作为成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '生姜汁'} ) return  n"
    },
    {
        "instruction": "需要7个中国系列分类信息实例",
        "input": "",
        "output": "match (n:中国系列) return n limit 7;"
    },
    {
        "instruction": "关于角鲨烯胶丸的详细信息如下：",
        "input": "",
        "output": "match (n:药品  { name: '角鲨烯胶丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "告诉我在使用清瘟解毒丸时需要注意的事项。",
        "input": "",
        "output": "match (n:药品 { name: '清瘟解毒丸' }) return n.note;"
    },
    {
        "instruction": "对于散风活血膏的使用，请注意相关事项",
        "input": "",
        "output": "match (n:药品 { name: '散风活血膏' }) return n.note;"
    },
    {
        "instruction": "中国系列有哪些细分的分类",
        "input": "",
        "output": "MATCH (n:中国系列) RETURN n;"
    },
    {
        "instruction": "请说明散风活血膏应避免使用的情况",
        "input": "",
        "output": "match (n:药品 { name: '散风活血膏' }) return n.taboo;"
    },
    {
        "instruction": "能提供大黄䗪虫丸的包装信息吗？",
        "input": "",
        "output": "match (n:药品 { name: '大黄䗪虫丸' }) return n.specifications;"
    },
    {
        "instruction": "对于胃康灵胶囊的使用，需要注意以下几点：",
        "input": "",
        "output": "match (n:药品 { name: '胃康灵胶囊' }) return n.note;"
    },
    {
        "instruction": "我想了解竹沥水的包装规格是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '竹沥水' }) return n.specifications;"
    },
    {
        "instruction": "请说明养胃片应避免的情况",
        "input": "",
        "output": "match (n:药品 { name: '养胃片' }) return n.taboo;"
    },
    {
        "instruction": "请提供妙灵丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '妙灵丸' }) return n.specifications;"
    },
    {
        "instruction": "请告诉我胃安胶囊禁忌使用的事项",
        "input": "",
        "output": "match (n:药品 { name: '胃安胶囊' }) return n.taboo;"
    },
    {
        "instruction": "请阐述一下清热丸的药理作用，另外，有哪些其他药品也有类似功效呢？",
        "input": "",
        "output": "match (n:药品 { name: '清热丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请问天麻丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '天麻丸' }) return n.specifications;"
    },
    {
        "instruction": "全面介绍明目蒺藜丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '明目蒺藜丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "我想了解豨莶片的包装规格是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '豨莶片' }) return n.specifications;"
    },
    {
        "instruction": "以下是防风通圣丸所使用的部分辅料：",
        "input": "",
        "output": "match (n:药品 { name: '防风通圣丸' })-[r:辅料]->(m) return m; "
    },
    {
        "instruction": "列出养血安神片的禁用情况",
        "input": "",
        "output": "match (n:药品 { name: '养血安神片' }) return n.taboo;"
    },
    {
        "instruction": "请求查询并返回8条药品数据",
        "input": "",
        "output": "match (n:药品) return n limit 8;"
    },
    {
        "instruction": "能否告知黑锡丹的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '黑锡丹' }) return n.specifications;"
    },
    {
        "instruction": "请提供人参再造丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '人参再造丸' }) return n.specifications;"
    },
    {
        "instruction": "请告诉我百花定喘丸的包装大小是多少",
        "input": "",
        "output": "match (n:药品 { name: '百花定喘丸' }) return n.specifications;"
    },
    {
        "instruction": "乌金丸使用时需要注意的事项有以下几点",
        "input": "",
        "output": "match (n:药品 { name: '乌金丸' }) return n.note;"
    },
    {
        "instruction": "详细阐述一下更年安胶囊的特性。",
        "input": "",
        "output": "match (n:药品 { name: '更年安胶囊' }) return n.character;"
    },
    {
        "instruction": "我想了解童宝乐片的包装规格是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '童宝乐片' }) return n.specifications;"
    },
    {
        "instruction": "清胃黄连片的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '清胃黄连片'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "禁忌症包括但不限于以下内容：",
        "input": "",
        "output": "match (n:药品 { name: '华山参滴丸' }) return n.taboo;"
    },
    {
        "instruction": "关于安神补气丸的特性，如下所示：",
        "input": "",
        "output": "match (n:药品 { name: '安神补气丸' }) return n.character;"
    },
    {
        "instruction": "全面介绍止红肠辟丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '止红肠辟丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否告知跌打片的包装详情",
        "input": "",
        "output": "match (n:药品 { name: '跌打片' }) return n.specifications;"
    },
    {
        "instruction": "请问风湿关节炎片的包装是什么样子的？",
        "input": "",
        "output": "match (n:药品 { name: '风湿关节炎片' }) return n.specifications;"
    },
    {
        "instruction": "能否告知风湿关节炎丸的规格信息？",
        "input": "",
        "output": "match (n:药品 { name: '风湿关节炎丸' }) return n.specifications;"
    },
    {
        "instruction": "我将整理七制香附丸的全面信息，包括它的用途、成分、用法等，你需要特别关注的点是什么？",
        "input": "",
        "output": "match (n:药品  { name: '七制香附丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请问沉香化滞丸的包装规格是怎样的？",
        "input": "",
        "output": "match (n:药品 { name: '沉香化滞丸' }) return n.specifications;"
    },
    {
        "instruction": "全面介绍槟榔四消片的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '槟榔四消片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请提供五仁润肠丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '五仁润肠丸' }) return n.specifications;"
    },
    {
        "instruction": "请提供脉络通的包装规格信息。",
        "input": "",
        "output": "match (n:药品 { name: '脉络通' }) return n.specifications;"
    },
    {
        "instruction": "能否告知藿香正气软胶囊的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '藿香正气软胶囊' }) return n.specifications;"
    },
    {
        "instruction": "请阐述一下温经丸的主要作用，并给出其他具有类似作用的药品名。",
        "input": "",
        "output": "match (n:药品 { name: '温经丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请提供关于六合定中丸的详细特征信息。",
        "input": "",
        "output": "match (n:药品 { name: '六合定中丸' }) return n.character;"
    },
    {
        "instruction": "我想了解牛黄上清片的包装规格是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '牛黄上清片' }) return n.specifications;"
    },
    {
        "instruction": "请提供当归龙荟片的详细特征。",
        "input": "",
        "output": "match (n:药品 { name: '当归龙荟片' }) return n.character;"
    },
    {
        "instruction": "请告诉我豨桐丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '豨桐丸' }) return n.specifications;"
    },
    {
        "instruction": "养胃片使用时需要注意的事项有哪些？",
        "input": "",
        "output": "match (n:药品 { name: '养胃片' }) return n.note;"
    },
    {
        "instruction": "能详细描述一下这种药品的功效吗？另外，有哪些其他药品也有类似的效果？",
        "input": "",
        "output": "match (n:药品 { name: '得生片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请告知消炎解毒丸的禁忌与限制",
        "input": "",
        "output": "match (n:药品 { name: '消炎解毒丸' }) return n.taboo;"
    },
    {
        "instruction": "伤科壮骨膏的特征信息可以详细说明一下吗？",
        "input": "",
        "output": "match (n:药品 { name: '伤科壮骨膏' }) return n.character;"
    },
    {
        "instruction": "能告诉我中国脑里包含哪些药品吗？这些药品主要由哪些药材组成？",
        "input": "",
        "output": "match (n {name :'中国脑'} )<-[r:分类]-(m)-[r1:主要成分]->(k)   return n,m,k;"
    },
    {
        "instruction": "列出清凉油的禁用事项",
        "input": "",
        "output": "match (n:药品 { name: '清凉油' }) return n.taboo;"
    },
    {
        "instruction": "能否告知木瓜片的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '木瓜片' }) return n.specifications;"
    },
    {
        "instruction": "特征信息如下：香苏正胃丸",
        "input": "",
        "output": "match (n:药品 { name: '香苏正胃丸' }) return n.character;"
    },
    {
        "instruction": "我想了解京万红痔疮膏的包装大小",
        "input": "",
        "output": "match (n:药品 { name: '京万红痔疮膏' }) return n.specifications;"
    },
    {
        "instruction": "复方百部止咳糖浆的禁忌事项是什么？",
        "input": "",
        "output": "match (n:药品 { name: '复方百部止咳糖浆' }) return n.taboo;"
    },
    {
        "instruction": "能否介绍一下左金丸的药效？并提供一些具有类似效果的药品名字。",
        "input": "",
        "output": "match (n:药品 { name: '左金丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请提供藿香正气颗粒的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '藿香正气颗粒' }) return n.specifications;"
    },
    {
        "instruction": "阐述人参归脾丸的特征详情",
        "input": "",
        "output": "match (n:药品 { name: '人参归脾丸' }) return n.character;"
    },
    {
        "instruction": "保安万灵丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '保安万灵丸' }) return n.specifications;"
    },
    {
        "instruction": "针对心前区的刺痛，您能推荐一些药品吗？",
        "input": "",
        "output": "match (n:药品)-[r:适应症状]->(m :症状 { name : '心前区刺痛' }) return   n ;"
    },
    {
        "instruction": "请提供十香止痛丸的详细特征。",
        "input": "",
        "output": "match (n:药品 { name: '十香止痛丸' }) return n.character;"
    },
    {
        "instruction": "请详细说明橘红化痰丸使用时需要注意的事项。",
        "input": "",
        "output": "match (n:药品 { name: '橘红化痰丸' }) return n.note;"
    },
    {
        "instruction": "能否告知消炎解毒丸的规格详情",
        "input": "",
        "output": "match (n:药品 { name: '消炎解毒丸' }) return n.specifications;"
    },
    {
        "instruction": "获取药品信息，包含哪些",
        "input": "",
        "output": "match (n:药品) return n;"
    },
    {
        "instruction": "我想了解医痫丸的特性，请提供相关详细信息。",
        "input": "",
        "output": "match (n:药品 { name: '医痫丸' }) return n.character;"
    },
    {
        "instruction": "请问牙痛药水的包装大小是多少？",
        "input": "",
        "output": "match (n:药品 { name: '牙痛药水' }) return n.specifications;"
    },
    {
        "instruction": "清热凉血丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '清热凉血丸' }) return n.specifications;"
    },
    {
        "instruction": "阐述康尔心胶囊的特征和属性",
        "input": "",
        "output": "match (n:药品 { name: '康尔心胶囊' }) return n.character;"
    },
    {
        "instruction": "能否介绍一下热毒平颗粒的药效？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '热毒平颗粒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请问益肾液的包装规格是怎样的？",
        "input": "",
        "output": "match (n:药品 { name: '益肾液' }) return n.specifications;"
    },
    {
        "instruction": "以下是香连化滞片的主要特征：",
        "input": "",
        "output": "match (n:药品 { name: '香连化滞片' }) return n.character;"
    },
    {
        "instruction": "咳喘宁的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '咳喘宁' }) return n.specifications;"
    },
    {
        "instruction": "能否告知复方蟾酥丸的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '复方蟾酥丸' }) return n.specifications;"
    },
    {
        "instruction": "能否告知仁丹的包装容量详情",
        "input": "",
        "output": "match (n:药品 { name: '仁丹' }) return n.specifications;"
    },
    {
        "instruction": "禁忌事项是八珍益母丸的重要内容，需要详细了解。",
        "input": "",
        "output": "match (n:药品 { name: '八珍益母丸' }) return n.taboo;"
    },
    {
        "instruction": "心脑康胶囊的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '心脑康胶囊' }) return n.specifications;"
    },
    {
        "instruction": "描述一下胃康灵胶囊的特性详情",
        "input": "",
        "output": "match (n:药品 { name: '胃康灵胶囊' }) return n.character;"
    },
    {
        "instruction": "请提供六味地黄片的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '六味地黄片' }) return n.specifications;"
    },
    {
        "instruction": "请告诉我小活络片的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '小活络片' }) return n.specifications;"
    },
    {
        "instruction": "请提供关于角鲨烯胶丸的使用指导",
        "input": "",
        "output": "match (n:药品  { name: '角鲨烯胶丸' }) return  n.useMethod ; "
    },
    {
        "instruction": "请提供催乳丸的详细特性描述。",
        "input": "",
        "output": "match (n:药品 { name: '催乳丸' }) return n.character;"
    },
    {
        "instruction": "查询包含哪些药材",
        "input": "",
        "output": "match (n:药材) return n;"
    },
    {
        "instruction": "精制银翘解毒片的特性描述能给我吗？",
        "input": "",
        "output": "match (n:药品 { name: '精制银翘解毒片' }) return n.character;"
    },
    {
        "instruction": "七珍丸的特性信息可以详细说明一下吗？",
        "input": "",
        "output": "match (n:药品 { name: '七珍丸' }) return n.character;"
    },
    {
        "instruction": "四神丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '四神丸' }) return n.specifications;"
    },
    {
        "instruction": "能详细说一下清咽滴丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '清咽滴丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项请对茵陈五疸丸进行详细阅读。",
        "input": "",
        "output": "match (n:药品 { name: '茵陈五疸丸' }) return n.note;"
    },
    {
        "instruction": "能否详细描述沉香舒郁片的药效？并列出其他具有类似作用的药品名字。",
        "input": "",
        "output": "match (n:药品 { name: '沉香舒郁片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "以下是参附强心丸的主要特征：",
        "input": "",
        "output": "match (n:药品 { name: '参附强心丸' }) return n.character;"
    },
    {
        "instruction": "请提供蟾麝救心丸的特性信息。",
        "input": "",
        "output": "match (n:药品 { name: '蟾麝救心丸' }) return n.character;"
    },
    {
        "instruction": "请说明防风通圣丸的禁用情况",
        "input": "",
        "output": "match (n:药品 { name: '防风通圣丸' }) return n.taboo;"
    },
    {
        "instruction": "请提供跌打丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '跌打丸' }) return n.specifications;"
    },
    {
        "instruction": "给出梅花点舌丸的详细特征描述",
        "input": "",
        "output": "match (n:药品 { name: '梅花点舌丸' }) return n.character;"
    },
    {
        "instruction": "关于二母安嗽糖浆，我需要你提供其主要特征和信息。",
        "input": "",
        "output": "match (n:药品 { name: '二母安嗽糖浆' }) return n.character;"
    },
    {
        "instruction": "清瘟解毒丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '清瘟解毒丸' }) return n.specifications;"
    },
    {
        "instruction": "滋肾丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '滋肾丸' }) return n.specifications;"
    },
    {
        "instruction": "确认三核九翼的细分方向有哪些",
        "input": "",
        "output": "match (n:三核九翼) return n;"
    },
    {
        "instruction": "详细描述一下牛黄上清片的所有信息",
        "input": "",
        "output": "match (n:药品  { name: '牛黄上清片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    }
]