[
    {
        "instruction": "请求获取2条辅料的数据详情",
        "input": "",
        "output": "match (n:辅料) return n limit 2;"
    },
    {
        "instruction": "能否阐述一下六经头痛片的药效？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '六经头痛片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "速效心痛滴丸的禁忌事项是什么？",
        "input": "",
        "output": "match (n:药品 { name: '速效心痛滴丸' }) return n.taboo;"
    },
    {
        "instruction": "哪些药品可以使用蛴螬(炒)作为成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '蛴螬(炒)'} ) return  n"
    },
    {
        "instruction": "能否介绍一下舟车丸的药效？并提供一些具有类似效果的药品名字。",
        "input": "",
        "output": "match (n:药品 { name: '舟车丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "金匮肾气丸的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '金匮肾气丸' }) return n.character;"
    },
    {
        "instruction": "四季三黄片的特性信息能否列举？",
        "input": "",
        "output": "match (n:药品 { name: '四季三黄片' }) return n.character;"
    },
    {
        "instruction": "清眩软胶囊的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '清眩软胶囊' }) return n.specifications;"
    },
    {
        "instruction": "旋覆花可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '旋覆花'} ) return  n"
    },
    {
        "instruction": "请提供乌鸡白凤片的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '乌鸡白凤片' }) return n.specifications;"
    },
    {
        "instruction": "请提供牛黄解毒丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '牛黄解毒丸' }) return n.specifications;"
    },
    {
        "instruction": "药品中滑石粉的用途是什么？",
        "input": "",
        "output": "match (n:药品)-[r:辅料成分]->(m :辅料 { name : '滑石粉' }) return n;"
    },
    {
        "instruction": "请罗列四神片的使用注意事项",
        "input": "",
        "output": "match (n:药品 { name: '四神片' }) return n.note;"
    },
    {
        "instruction": "能否提供凉血祛风糖浆的包装规格信息？",
        "input": "",
        "output": "match (n:药品 { name: '凉血祛风糖浆' }) return n.specifications;"
    },
    {
        "instruction": "角鲨烯胶丸的包装详情是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '角鲨烯胶丸' }) return n.specifications;"
    },
    {
        "instruction": "请介绍一下定喘膏的主要作用，还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '定喘膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项如下：\n1. 竹沥水可能引起过敏反应，使用前请确保您对竹沥水成分无过敏史。\n2. 孕妇和哺乳期妇女在使用竹沥水前应先咨询医生。\n3. 对于儿童，应在成人监护下使用，并按照医生建议的剂量给予。",
        "input": "",
        "output": "match (n:药品 { name: '竹沥水' }) return n.note;"
    },
    {
        "instruction": "介绍一下香连丸的作用，还有其他什么药品有相同或类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '香连丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "描述舒筋跌打膏的特性信息",
        "input": "",
        "output": "match (n:药品 { name: '舒筋跌打膏' }) return n.character;"
    },
    {
        "instruction": "全面介绍十香返生丸的内容",
        "input": "",
        "output": "match (n:药品  { name: '十香返生丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "夜尿宁丸的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '夜尿宁丸' }) return n.character;"
    },
    {
        "instruction": "开胃健脾丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '开胃健脾丸' }) return n.specifications;"
    },
    {
        "instruction": "请告诉我肺安片的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '肺安片' }) return n.specifications;"
    },
    {
        "instruction": "请提供脑立清片的详细特性",
        "input": "",
        "output": "match (n:药品 { name: '脑立清片' }) return n.character;"
    },
    {
        "instruction": "讨论一下消积化虫糖浆的治疗效果，还有其他什么药品具有类似作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '消积化虫糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请问慢病类的药品都有哪些种类？它们主要使用哪些药材？",
        "input": "",
        "output": "match (n {name:'慢病类'})<-[r:分类]-(m)-[r1:主要成分]->(k)   return n,m,k;"
    },
    {
        "instruction": "康尔心胶囊的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '康尔心胶囊'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "哪些药品可以使用麸炒山药作为成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '麸炒山药'} ) return  n"
    },
    {
        "instruction": "清瘟解毒片的主要成分包含哪些药材？",
        "input": "",
        "output": "match (n:药品 {name: '清瘟解毒片'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "全面介绍洋参保肺丸的内容",
        "input": "",
        "output": "match (n:药品  { name: '洋参保肺丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请详细说明童宝乐片使用时需要注意的事项。",
        "input": "",
        "output": "match (n:药品 { name: '童宝乐片' }) return n.note;"
    },
    {
        "instruction": "夜尿宁丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '夜尿宁丸' }) return n.specifications;"
    },
    {
        "instruction": "请详细描述一下清胃黄连片的药效，另外还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '清胃黄连片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下胃肠安丸的主要作用，另外还有哪些药品在这方面有相似效果？",
        "input": "",
        "output": "match (n:药品 { name: '胃肠安丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "在人参再造丸中，辅料的组成有",
        "input": "",
        "output": "match (n:药品 { name: '人参再造丸' })-[r:辅料]->(m) return m; "
    },
    {
        "instruction": "八珍益母丸的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '八珍益母丸' }) return n.character;"
    },
    {
        "instruction": "请提供六灵丸的禁忌信息",
        "input": "",
        "output": "match (n:药品 { name: '六灵丸' }) return n.taboo;"
    },
    {
        "instruction": "栀子(焦)可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '栀子(焦)'} ) return  n"
    },
    {
        "instruction": "槐米可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '槐米'} ) return  n"
    },
    {
        "instruction": "获取完整的5条中国系列分类信息",
        "input": "",
        "output": "match (n:中国系列) return n limit 5;"
    },
    {
        "instruction": "讨论一下舟车丸的功效，还有其他哪些药品有类似效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '舟车丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "查询一下，数据库中存储的药品种类数",
        "input": "",
        "output": "match (n:药品 ) return count(*);"
    },
    {
        "instruction": "请给出可以作为辅助成分的物品列表",
        "input": "",
        "output": "MATCH (n:辅料) RETURN n;"
    },
    {
        "instruction": "描述一下银翘解毒颗粒的特性详情",
        "input": "",
        "output": "match (n:药品 { name: '银翘解毒颗粒' }) return n.character;"
    },
    {
        "instruction": "给出散风宁嗽糖浆的详细特性",
        "input": "",
        "output": "match (n:药品 { name: '散风宁嗽糖浆' }) return n.character;"
    },
    {
        "instruction": "请提供抗腮灵糖浆的详细特性",
        "input": "",
        "output": "match (n:药品 { name: '抗腮灵糖浆' }) return n.character;"
    },
    {
        "instruction": "请提供活络镇痛片的禁忌信息",
        "input": "",
        "output": "match (n:药品 { name: '活络镇痛片' }) return n.taboo;"
    },
    {
        "instruction": "皂角子可以用在哪些药品里？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '皂角子'} ) return  n"
    },
    {
        "instruction": "能否告知胃痛定的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '胃痛定' }) return n.specifications;"
    },
    {
        "instruction": "全面阐述一下孕妇金花丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '孕妇金花丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能详细说一下复方丹参片的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '复方丹参片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "哪些药品可以使用苦地丁作为成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '苦地丁'} ) return  n"
    },
    {
        "instruction": "关于二母安嗽片的特征信息，能为您提供吗？",
        "input": "",
        "output": "match (n:药品 { name: '二母安嗽片' }) return n.character;"
    },
    {
        "instruction": "请提供心脑康胶囊的详细特性",
        "input": "",
        "output": "match (n:药品 { name: '心脑康胶囊' }) return n.character;"
    },
    {
        "instruction": "能否介绍一下风湿酒药品的功效？类似功效的药品有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '风湿酒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "全面介绍活络镇痛片的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '活络镇痛片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "清胃黄连片的禁忌事项需要给出。",
        "input": "",
        "output": "match (n:药品 { name: '清胃黄连片' }) return n.taboo;"
    },
    {
        "instruction": "请求查询并返回11条中国系列分类",
        "input": "",
        "output": "match (n:中国系列) return n limit 11;"
    },
    {
        "instruction": "能否阐述一下益肾液的主要效果？还有没有其他药品具有类似的功能呢？",
        "input": "",
        "output": "match (n:药品 { name: '益肾液' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "金果榄可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '金果榄'} ) return  n"
    },
    {
        "instruction": "请告诉我牛黄降压胶囊的包装信息。",
        "input": "",
        "output": "match (n:药品 { name: '牛黄降压胶囊' }) return n.specifications;"
    },
    {
        "instruction": "全面阐述得生片的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '得生片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "止嗽定喘口服液的全部资料是什么",
        "input": "",
        "output": "match (n:药品  { name: '止嗽定喘口服液' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请查收慢惊丸的全部信息。",
        "input": "",
        "output": "match (n:药品  { name: '慢惊丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请提供活络丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '活络丸' }) return n.specifications;"
    },
    {
        "instruction": "展示4条药品数据详情",
        "input": "",
        "output": "match (n:药品) return n limit 4;"
    },
    {
        "instruction": "展示5条辅料的详细数据",
        "input": "",
        "output": "match (n:辅料) return n limit 5;"
    },
    {
        "instruction": "注意事项如下：女金丸。",
        "input": "",
        "output": "match (n:药品 { name: '女金丸' }) return n.note;"
    },
    {
        "instruction": "提供一粒珠的特征信息详解",
        "input": "",
        "output": "match (n:药品 { name: '一粒珠' }) return n.character;"
    },
    {
        "instruction": "请告诉我橘红丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '橘红丸' }) return n.specifications;"
    },
    {
        "instruction": "清心牛黄片的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '清心牛黄片' }) return n.character;"
    },
    {
        "instruction": "我想了解风湿镇痛丸的包装情况，请告知",
        "input": "",
        "output": "match (n:药品 { name: '风湿镇痛丸' }) return n.specifications;"
    },
    {
        "instruction": "请提供通脉滴丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '通脉滴丸' }) return n.specifications;"
    },
    {
        "instruction": "能否详细描述一下益肾灵颗粒的药效，并给出其他具有类似效果的药品名字？",
        "input": "",
        "output": "match (n:药品 { name: '益肾灵颗粒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请注意阳和解凝膏的使用注意事项。",
        "input": "",
        "output": "match (n:药品 { name: '阳和解凝膏' }) return n.note;"
    },
    {
        "instruction": "描述心可宁胶囊的特征详情",
        "input": "",
        "output": "match (n:药品 { name: '心可宁胶囊' }) return n.character;"
    },
    {
        "instruction": "请问更年安片的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '更年安片' }) return n.specifications;"
    },
    {
        "instruction": "骨痛丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '骨痛丸' }) return n.specifications;"
    },
    {
        "instruction": "查询人参养荣丸的包装规格",
        "input": "",
        "output": "match (n:药品 { name: '人参养荣丸' }) return n.specifications;"
    },
    {
        "instruction": "给出三鞭酒使用时需要注意的点。",
        "input": "",
        "output": "match (n:药品 { name: '三鞭酒' }) return n.note;"
    },
    {
        "instruction": "请问涤痰丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '涤痰丸' }) return n.specifications;"
    },
    {
        "instruction": "能否提供一些关于泌尿类药物的信息，包括它们使用的药材?",
        "input": "",
        "output": "match (n {name:'泌尿类'})<-[r:分类]-(m)-[r1:主要成分]->(k)   return n,m,k;"
    },
    {
        "instruction": "请提供橘红化痰丸的详细特性",
        "input": "",
        "output": "match (n:药品 { name: '橘红化痰丸' }) return n.character;"
    },
    {
        "instruction": "我想了解桑菊感冒糖浆的包装大小",
        "input": "",
        "output": "match (n:药品 { name: '桑菊感冒糖浆' }) return n.specifications;"
    },
    {
        "instruction": "济坤丸的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '济坤丸' }) return n.character;"
    },
    {
        "instruction": "请提供大活络丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '大活络丸' }) return n.specifications;"
    },
    {
        "instruction": "我想了解二母安嗽丸的包装规格是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '二母安嗽丸' }) return n.specifications;"
    },
    {
        "instruction": "我想了解益肾糖浆的包装大小和规格。",
        "input": "",
        "output": "match (n:药品 { name: '益肾糖浆' }) return n.specifications;"
    },
    {
        "instruction": "我想了解藿香正气水的包装详情",
        "input": "",
        "output": "match (n:药品 { name: '藿香正气水' }) return n.specifications;"
    },
    {
        "instruction": "请查收通脉养心口服液的特征信息",
        "input": "",
        "output": "match (n:药品 { name: '通脉养心口服液' }) return n.character;"
    },
    {
        "instruction": "请提供济生肾气丸的详细特性描述",
        "input": "",
        "output": "match (n:药品 { name: '济生肾气丸' }) return n.character;"
    },
    {
        "instruction": "九制大黄丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '九制大黄丸' }) return n.specifications;"
    },
    {
        "instruction": "请问更年安胶囊的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '更年安胶囊' }) return n.specifications;"
    },
    {
        "instruction": "请提供六灵丸的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '六灵丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请解析一下茵陈酒的药用价值，还有其他什么药品具有类似疗效呢？",
        "input": "",
        "output": "match (n:药品 { name: '茵陈酒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否告知肥儿丸的包装详情",
        "input": "",
        "output": "match (n:药品 { name: '肥儿丸' }) return n.specifications;"
    },
    {
        "instruction": "能详细说一下清热丸的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '清热丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "告诉我使用清瘟解毒丸应避免什么情况",
        "input": "",
        "output": "match (n:药品 { name: '清瘟解毒丸' }) return n.taboo;"
    },
    {
        "instruction": "以下是白金丸的详细特征：",
        "input": "",
        "output": "match (n:药品 { name: '白金丸' }) return n.character;"
    },
    {
        "instruction": "请提供关于童宝乐片的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '童宝乐片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "查询药材，请求5个数据案例",
        "input": "",
        "output": "match (n:药材) return n limit 5;"
    },
    {
        "instruction": "请阐述一下良附丸的药品功效，另外，有哪些其他药品也有类似的作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '良附丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请告诉我祛暑露的包装大小是多少？",
        "input": "",
        "output": "match (n:药品 { name: '祛暑露' }) return n.specifications;"
    },
    {
        "instruction": "以下是在胃康灵胶囊中发现的辅料：",
        "input": "",
        "output": "match (n:药品 { name: '胃康灵胶囊' })-[r:辅料]->(m) return m; "
    },
    {
        "instruction": "能详细说一下橡皮生肌膏的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '橡皮生肌膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否告知洋参保肺丸的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '洋参保肺丸' }) return n.specifications;"
    },
    {
        "instruction": "妇科回生丸的禁忌事项需要给出。",
        "input": "",
        "output": "match (n:药品 { name: '妇科回生丸' }) return n.taboo;"
    },
    {
        "instruction": "请告诉我痹祺胶囊的禁忌事项。",
        "input": "",
        "output": "match (n:药品 { name: '痹祺胶囊' }) return n.taboo;"
    },
    {
        "instruction": "请列举三鞭酒的所有资料",
        "input": "",
        "output": "match (n:药品  { name: '三鞭酒' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "鹿角霜可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '鹿角霜'} ) return  n"
    },
    {
        "instruction": "请提供五加皮酒的包装详情",
        "input": "",
        "output": "match (n:药品 { name: '五加皮酒' }) return n.specifications;"
    },
    {
        "instruction": "我想了解十味玉泉片的包装信息，能告诉我吗？",
        "input": "",
        "output": "match (n:药品 { name: '十味玉泉片' }) return n.specifications;"
    },
    {
        "instruction": "我想了解清咽滴丸的特性信息，请告诉我。",
        "input": "",
        "output": "match (n:药品 { name: '清咽滴丸' }) return n.character;"
    },
    {
        "instruction": "需要获取复方蟾酥丸的全部详细信息",
        "input": "",
        "output": "match (n:药品  { name: '复方蟾酥丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "详细描述五淋丸的特性内容。",
        "input": "",
        "output": "match (n:药品 { name: '分清五淋丸' }) return n.character;"
    },
    {
        "instruction": "哪些药品可以使用茅根炭作为成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '茅根炭'} ) return  n"
    },
    {
        "instruction": "讨论一下小儿金丹片的功效，同时给出其他具有类似疗效的药品名",
        "input": "",
        "output": "match (n:药品 { name: '小儿金丹片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "参茸卫生丸的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '参茸卫生丸' }) return n.character;"
    },
    {
        "instruction": "请介绍一下益肾液的功效，另外，有哪些其他药品有类似的作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '益肾液' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请提供壮骨酒的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '壮骨酒' }) return n.specifications;"
    },
    {
        "instruction": "七制香附丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '七制香附丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "止带片的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '止带片'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "请列举四季三黄丸的特性详情",
        "input": "",
        "output": "match (n:药品 { name: '四季三黄丸' }) return n.character;"
    },
    {
        "instruction": "清肺抑火片的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '清肺抑火片' }) return n.character;"
    },
    {
        "instruction": "提供关于散风活血膏的特性信息详情",
        "input": "",
        "output": "match (n:药品 { name: '散风活血膏' }) return n.character;"
    },
    {
        "instruction": "药品中可以使用珍珠作为成分。",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '珍珠'} ) return  n"
    },
    {
        "instruction": "能否阐述一下人参再造丸的疗效？还有没有其他药品具有类似的功能呢？",
        "input": "",
        "output": "match (n:药品 { name: '人参再造丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请详细说明十香返生丸应避免使用的情况。",
        "input": "",
        "output": "match (n:药品 { name: '十香返生丸' }) return n.taboo;"
    },
    {
        "instruction": "能详细说一下益肾液药品的作用吗？还有哪些其他药品也有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '益肾液' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "清肺消炎丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '清肺消炎丸' }) return n.specifications;"
    },
    {
        "instruction": "请注意，使用百补增力丸时需遵循以下事项：",
        "input": "",
        "output": "match (n:药品 { name: '百补增力丸' }) return n.note;"
    },
    {
        "instruction": "孕妇金花片的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '孕妇金花片'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "我想了解附子理中片的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '附子理中片' }) return n.specifications;"
    },
    {
        "instruction": "请给出7个药品的数据例子",
        "input": "",
        "output": "match (n:药品) return n limit 7;"
    },
    {
        "instruction": "以下是牙痛药水的主要特性：",
        "input": "",
        "output": "match (n:药品 { name: '牙痛药水' }) return n.character;"
    },
    {
        "instruction": "请查收天麻丸的全部信息：",
        "input": "",
        "output": "match (n:药品  { name: '天麻丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否阐述一下养血调经膏的功效？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '养血调经膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "擦癣药水的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '擦癣药水' }) return n.specifications;"
    },
    {
        "instruction": "热毒平颗粒的禁忌事项是什么？",
        "input": "",
        "output": "match (n:药品 { name: '热毒平颗粒' }) return n.taboo;"
    },
    {
        "instruction": "请描述一下女金糖浆的主要作用，还有其他哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '女金糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否给出栀子金花丸的特征性信息？",
        "input": "",
        "output": "match (n:药品 { name: '栀子金花丸' }) return n.character;"
    },
    {
        "instruction": "能否详细介绍一下慢病类药品的种类及其主要药材成分？",
        "input": "",
        "output": "match (n {name:'慢病类'})<-[r:分类]-(m)-[r1:主要成分]->(k)   return n,m,k;"
    },
    {
        "instruction": "请提供搜风顺气丸的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '搜风顺气丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "禁忌事项对于香砂六君丸是重要的信息，需要明确了解。",
        "input": "",
        "output": "match (n:药品 { name: '香砂六君丸' }) return n.taboo;"
    },
    {
        "instruction": "请提供止痛水的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '止痛水' }) return n.specifications;"
    },
    {
        "instruction": "请提供胃肠安丸的详细特性",
        "input": "",
        "output": "match (n:药品 { name: '胃肠安丸' }) return n.character;"
    },
    {
        "instruction": "请提供参苓白术丸的禁忌信息",
        "input": "",
        "output": "match (n:药品 { name: '参苓白术丸' }) return n.taboo;"
    },
    {
        "instruction": "请阐述一下清眩软胶囊的主要作用，另外，有哪些其他药品也有类似的功能呢？",
        "input": "",
        "output": "match (n:药品 { name: '清眩软胶囊' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否分享一下八宝坤顺丸的药效？有没有其他药品也有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '八宝坤顺丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请阐述一下消炎解毒丸的治疗效果，还有其他什么药品具有类似功能呢？",
        "input": "",
        "output": "match (n:药品 { name: '消炎解毒丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "药品中琥珀的用途是什么",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '琥珀'} ) return  n"
    },
    {
        "instruction": "能否介绍一下蟾麝救心丸的药效？并提供一些具有类似药效的药品名字。",
        "input": "",
        "output": "match (n:药品 { name: '蟾麝救心丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "白糖作为原料可用于哪些药品制作",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '蛋白糖'} ) return  n"
    },
    {
        "instruction": "列举消积化滞片的特征信息点",
        "input": "",
        "output": "match (n:药品 { name: '消积化滞片' }) return n.character;"
    },
    {
        "instruction": "请提供四季三黄丸的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '四季三黄丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请提供八珍益母丸的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '八珍益母丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请问舒筋丸的包装规格是怎样的？",
        "input": "",
        "output": "match (n:药品 { name: '舒筋丸' }) return n.specifications;"
    },
    {
        "instruction": "我想了解大补阴丸的包装规格信息",
        "input": "",
        "output": "match (n:药品 { name: '大补阴丸' }) return n.specifications;"
    },
    {
        "instruction": "请提供京万红软膏的详细特性。",
        "input": "",
        "output": "match (n:药品 { name: '京万红软膏' }) return n.character;"
    },
    {
        "instruction": "我想了解胃安眠丸的特性信息，能给我总结一下吗？",
        "input": "",
        "output": "match (n:药品 { name: '和胃安眠丸' }) return n.character;"
    },
    {
        "instruction": "请提供关于益肾液的详细特征信息。",
        "input": "",
        "output": "match (n:药品 { name: '益肾液' }) return n.character;"
    },
    {
        "instruction": "以下是关于牙痛停滴丸的特征信息：",
        "input": "",
        "output": "match (n:药品 { name: '牙痛停滴丸' }) return n.character;"
    },
    {
        "instruction": "妇科回生丸的全部信息列举如下：",
        "input": "",
        "output": "match (n:药品  { name: '妇科回生丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请问得生丸的特征信息是什么？",
        "input": "",
        "output": "match (n:药品 { name: '得生丸' }) return n.character;"
    },
    {
        "instruction": "四季三黄片的包装大小是多少呢",
        "input": "",
        "output": "match (n:药品 { name: '四季三黄片' }) return n.specifications;"
    },
    {
        "instruction": "玄归滴丸的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '玄归滴丸' }) return n.character;"
    },
    {
        "instruction": "当归龙荟片有什么药效？类似效果的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '当归龙荟片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否告知人参归脾丸的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '人参归脾丸' }) return n.specifications;"
    },
    {
        "instruction": "热毒平颗粒的特性信息能否给出？",
        "input": "",
        "output": "match (n:药品 { name: '热毒平颗粒' }) return n.character;"
    },
    {
        "instruction": "能否给出益肾丸的特征和详细信息",
        "input": "",
        "output": "match (n:药品 { name: '益肾丸' }) return n.character;"
    },
    {
        "instruction": "请注意，使用杞菊地黄丸时需要遵循以下事项：",
        "input": "",
        "output": "match (n:药品 { name: '杞菊地黄丸' }) return n.note;"
    },
    {
        "instruction": "请告诉我小儿琥珀丸的包装规格。",
        "input": "",
        "output": "match (n:药品 { name: '小儿琥珀丸' }) return n.specifications;"
    },
    {
        "instruction": "关于健步壮骨丸的特征信息，请您查收。",
        "input": "",
        "output": "match (n:药品 { name: '健步壮骨丸' }) return n.character;"
    },
    {
        "instruction": "请提供白金丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '白金丸' }) return n.specifications;"
    },
    {
        "instruction": "请提供肥儿片的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '肥儿片' }) return n.specifications;"
    },
    {
        "instruction": "请提供清心牛黄片的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '清心牛黄片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "描述一下血脂宁丸的特性详情",
        "input": "",
        "output": "match (n:药品 { name: '血脂宁丸' }) return n.character;"
    },
    {
        "instruction": "请提供养血安神片的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '养血安神片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请注意查看消瘿五海丸的注意事项",
        "input": "",
        "output": "match (n:药品 { name: '消瘿五海丸' }) return n.note;"
    },
    {
        "instruction": "我想了解六味地黄胶囊的包装规格是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '六味地黄胶囊' }) return n.specifications;"
    },
    {
        "instruction": "请提供关于女金糖浆的详细特征描述。",
        "input": "",
        "output": "match (n:药品 { name: '女金糖浆' }) return n.character;"
    },
    {
        "instruction": "能告诉我泌尿类药品有哪些以及包含的药材吗?",
        "input": "",
        "output": "match (n {name:'泌尿类'})<-[r:分类]-(m)-[r1:主要成分]->(k)   return n,m,k;"
    },
    {
        "instruction": "列举国公酒的所有详情",
        "input": "",
        "output": "match (n:药品  { name: '国公酒' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否阐述一下养胃片的药理作用？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '养胃片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项请给出小活络丸的",
        "input": "",
        "output": "match (n:药品 { name: '小活络丸' }) return n.note;"
    },
    {
        "instruction": "解析痹祺胶囊的特征信息",
        "input": "",
        "output": "match (n:药品 { name: '痹祺胶囊' }) return n.character;"
    },
    {
        "instruction": "哪些药品可以使用浙贝母作为成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '浙贝母'} ) return  n"
    },
    {
        "instruction": "清喉利咽颗粒的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '清喉利咽颗粒' }) return n.character;"
    },
    {
        "instruction": "我想了解小儿琥珀丸的包装信息，能告诉我吗？",
        "input": "",
        "output": "match (n:药品 { name: '小儿琥珀丸' }) return n.specifications;"
    },
    {
        "instruction": "让我们聊聊胃肠安丸的药效，还有其他什么药品在这方面表现相似呢？",
        "input": "",
        "output": "match (n:药品 { name: '胃肠安丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "描述一下黄连上清片的禁忌事项是什么",
        "input": "",
        "output": "match (n:药品 { name: '黄连上清片' }) return n.taboo;"
    },
    {
        "instruction": "请问有什么药品可以解决口渴的问题？",
        "input": "",
        "output": "match (n:药品)-[r:适应症状]->(m :症状 { name : '口渴' }) return   n ;"
    },
    {
        "instruction": "讨论一下补益地黄丸的主要作用，还有哪些药品在功效上与其相似呢？",
        "input": "",
        "output": "match (n:药品 { name: '补益地黄丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否告知脉安颗粒的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '脉安颗粒' }) return n.specifications;"
    },
    {
        "instruction": "请提供关于仁丹的详细特征描述。",
        "input": "",
        "output": "match (n:药品 { name: '仁丹' }) return n.character;"
    },
    {
        "instruction": "橘红丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '橘红丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "请提供礞石滚痰丸的详细特性",
        "input": "",
        "output": "match (n:药品 { name: '礞石滚痰丸' }) return n.character;"
    },
    {
        "instruction": "我想了解银黄颗粒的包装大小和规格",
        "input": "",
        "output": "match (n:药品 { name: '银黄颗粒' }) return n.specifications;"
    },
    {
        "instruction": "能否详细描述一下孕妇金花片的特征信息？",
        "input": "",
        "output": "match (n:药品 { name: '孕妇金花片' }) return n.character;"
    }
]