[
    {
        "instruction": "能详细说一下安神补气丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '安神补气丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "白薇可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '白薇'} ) return  n"
    },
    {
        "instruction": "提供完整的癃清片资料",
        "input": "",
        "output": "match (n:药品  { name: '癃清片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能详细说一下五淋丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '分清五淋丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "金银花可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '金银花'} ) return  n"
    },
    {
        "instruction": "能告诉我角鲨烯胶丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '角鲨烯胶丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "对于耳聋和耳鸣，你想要了解有哪些药品可以推荐？",
        "input": "",
        "output": "match (n:药品)-[r:适应症状]->(m :症状 { name : '耳聋耳鸣' }) return   n ;"
    },
    {
        "instruction": "能否详细描述一下定喘膏的药效，并给出其他具有类似效果的药品名字？",
        "input": "",
        "output": "match (n:药品 { name: '定喘膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "全面介绍胃安胶囊的内容",
        "input": "",
        "output": "match (n:药品  { name: '胃安胶囊' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请查阅金芪降糖片的注意事项",
        "input": "",
        "output": "match (n:药品 { name: '金芪降糖片' }) return n.note;"
    },
    {
        "instruction": "我想了解一下人参归脾丸的主要作用，同时能否推荐一些具有类似效果的药品？",
        "input": "",
        "output": "match (n:药品 { name: '人参归脾丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "需要获取六经头痛片的全部详细信息",
        "input": "",
        "output": "match (n:药品  { name: '六经头痛片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否分享一下百效丸的功效？另外，还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '百效丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "讨论一下内消瘰疬片的功效，还有其他哪些药品有类似效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '内消瘰疬片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "鹿心粉可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '鹿心粉'} ) return  n"
    },
    {
        "instruction": "禁忌事项请给出女金片的",
        "input": "",
        "output": "match (n:药品 { name: '女金片' }) return n.taboo;"
    },
    {
        "instruction": "我想了解一下小儿清解颗粒药品的作用，同时能否推荐一些具有相似功效的药品？",
        "input": "",
        "output": "match (n:药品 { name: '小儿清解颗粒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "蛤壳可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '蛤壳'} ) return  n"
    },
    {
        "instruction": "能否阐述一下香苏正胃丸的治疗效果？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '香苏正胃丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细描述一下胃痛定药品的作用吗？另外，有哪些其他药品也有类似的效果？",
        "input": "",
        "output": "match (n:药品 { name: '胃痛定' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项是针对孕妇金花丸的使用而提出的，可能包括剂量、禁忌症、副作用等信息。例如：\n1. 孕妇在使用金花丸时，应遵照医生的指示，不可随意增减剂量。\n2. 对金花丸任何成分过敏的孕妇，应避免使用该药。\n3. 使用过程中如出现不适，应立即停用并咨询医生。",
        "input": "",
        "output": "match (n:药品 { name: '孕妇金花丸' }) return n.note;"
    },
    {
        "instruction": "请介绍一下心痛宁滴丸的药效，还有哪些药品在这方面表现相似？",
        "input": "",
        "output": "match (n:药品 { name: '心痛宁滴丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "桑椹可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '桑椹'} ) return  n"
    },
    {
        "instruction": "哪些药品可以使用皮子药作为成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '皮子药'} ) return  n"
    },
    {
        "instruction": "能否介绍一下连翘败毒片的药效，还有其他具有类似作用的药品名字？",
        "input": "",
        "output": "match (n:药品 { name: '连翘败毒片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "全面介绍速效心痛滴丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '速效心痛滴丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "陈皮木香可以用在哪些药品中",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '陈皮木香'} ) return  n"
    },
    {
        "instruction": "请介绍一下消积化滞片的药理，还有其他药品是否有类似效果？",
        "input": "",
        "output": "match (n:药品 { name: '消积化滞片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请详细描述人参归脾丸的药效，另外还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '人参归脾丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "讨论一下复方灵芝颗粒的药理作用，还有其他什么药品有类似的功能呢？",
        "input": "",
        "output": "match (n:药品 { name: '复方灵芝颗粒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能告诉我藿香正气水的主要作用吗？还有其他什么药品有类似的效果？",
        "input": "",
        "output": "match (n:药品 { name: '藿香正气水' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能告诉我香连丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '香连丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "数据库里的药材种类数能提供一下吗？",
        "input": "",
        "output": "match (n:药材 ) return count(*);"
    },
    {
        "instruction": "关于长城止咳喘糖浆，能否给出完整的信息详情？",
        "input": "",
        "output": "match (n:药品  { name: '长城止咳喘糖浆' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请注意清金止嗽化痰丸的用药事项",
        "input": "",
        "output": "match (n:药品 { name: '清金止嗽化痰丸' }) return n.note;"
    },
    {
        "instruction": "清宁丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '清宁丸' }) return n.specifications;"
    },
    {
        "instruction": "四季三黄丸的辅料包括有哪些？",
        "input": "",
        "output": "match (n:药品 { name: '四季三黄丸' })-[r:辅料]->(m) return m; "
    },
    {
        "instruction": "请告诉我槟榔四消片的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '槟榔四消片' }) return n.specifications;"
    },
    {
        "instruction": "我想了解更年安片的包装信息，能告诉我吗？",
        "input": "",
        "output": "match (n:药品 { name: '更年安片' }) return n.specifications;"
    },
    {
        "instruction": "讨论一下耳聋通窍丸的功效，还有哪些药品在这方面表现相似？",
        "input": "",
        "output": "match (n:药品 { name: '耳聋通窍丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能告诉我喉痛丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '喉痛丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说一下益肾糖浆的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '益肾糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下附子理中丸的功效，另外，有哪些其他药品也有类似的作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '附子理中丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "药品中可以使用雄黄作为成分。",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '雄黄'} ) return  n"
    },
    {
        "instruction": "请阐述心脑静片药品的功效，同时列举几个同类药品的名称。",
        "input": "",
        "output": "match (n:药品 { name: '心脑静片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "我想了解四季三黄丸的包装规格是什么",
        "input": "",
        "output": "match (n:药品 { name: '四季三黄丸' }) return n.specifications;"
    },
    {
        "instruction": "我想了解使用银翘解毒片时应避免的事项，请告诉我。",
        "input": "",
        "output": "match (n:药品 { name: '银翘解毒片' }) return n.note;"
    },
    {
        "instruction": "哪些药品可以使用铜绿作为成分",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '铜绿'} ) return  n"
    },
    {
        "instruction": "硫磺可用于哪些药品的制备？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '硫磺'} ) return  n"
    },
    {
        "instruction": "能否分享一下热毒平颗粒药品的疗效？有没有其他药品在这方面与之相似？",
        "input": "",
        "output": "match (n:药品 { name: '热毒平颗粒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能告诉我人参养荣丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '人参养荣丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "益肺清化膏的主要成分包含哪些药材？",
        "input": "",
        "output": "match (n:药品 {name: '益肺清化膏'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "想了解一下妙灵丸的药效，有没有其他药品也有类似效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '妙灵丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "药品中可以使用枫香脂作为成分，请问枫香脂在哪些药品中有应用？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '枫香脂'} ) return  n"
    },
    {
        "instruction": "能否介绍一下心脑静片的效果，并给出其他具有类似作用的药品名字？",
        "input": "",
        "output": "match (n:药品 { name: '心脑静片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "茵陈五疸丸的信息如下：",
        "input": "",
        "output": "match (n:药品  { name: '茵陈五疸丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否阐述一下二陈丸的药理作用？还有没有其他药品也有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '二陈丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "二母安嗽丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '二母安嗽丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "可用于哪些药品的成分是玳瑁粉？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '玳瑁粉'} ) return  n"
    },
    {
        "instruction": "对于行走不便的情况，你是否需要我推荐一些药品来帮助缓解？",
        "input": "",
        "output": "match (n:药品)-[r:适应症状]->(m :症状 { name : '行走不便' }) return   n ;"
    },
    {
        "instruction": "炒薏仁可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '炒意哎仁'} ) return  n"
    },
    {
        "instruction": "活络镇痛片的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '活络镇痛片' }) return n.specifications;"
    },
    {
        "instruction": "能否阐述一下牛黄抱龙丸的药品作用？类似效果的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '牛黄抱龙丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否阐述一下胃痛定药品的疗效，并给出其他具有相近疗效的药品名？",
        "input": "",
        "output": "match (n:药品 { name: '胃痛定' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请注意使用心痛宁滴丸时的注意事项。",
        "input": "",
        "output": "match (n:药品 { name: '心痛宁滴丸' }) return n.note;"
    },
    {
        "instruction": "查询华山参滴丸的所有详细信息。",
        "input": "",
        "output": "match (n:药品  { name: '华山参滴丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请介绍一下仙茸壮阳口服液的功效，另外，有哪些其他药品也有同样的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '仙茸壮阳口服液' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "药品中可以使用白糖作为原料或成分的包括哪些？",
        "input": "",
        "output": "match (n:药品)-[r:辅料成分]->(m :辅料 { name : '白糖' }) return n;"
    },
    {
        "instruction": "聊聊黄连羊肝片的功效吧，还有没有其他药品在这方面表现相似？",
        "input": "",
        "output": "match (n:药品 { name: '黄连羊肝片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "心痛宁滴丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '心痛宁滴丸' }) return n.specifications;"
    },
    {
        "instruction": "能详细说一下催乳丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '催乳丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项是针对万氏牛黄清心丸的一些重要提醒，可能包括服药时间、禁忌症、副作用等。请仔细阅读并遵照医嘱使用。",
        "input": "",
        "output": "match (n:药品 { name: '万氏牛黄清心丸' }) return n.note;"
    },
    {
        "instruction": "描述清喉利咽颗粒使用时应避免的事项",
        "input": "",
        "output": "match (n:药品 { name: '清喉利咽颗粒' }) return n.taboo;"
    },
    {
        "instruction": "注意事项是对于速效心痛滴丸的重要提示，需要详细了解。",
        "input": "",
        "output": "match (n:药品 { name: '速效心痛滴丸' }) return n.note;"
    },
    {
        "instruction": "补心片的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '补心片'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "请阐述追风丸的药理，并给出其他具有类似药效的药品名字。",
        "input": "",
        "output": "match (n:药品 { name: '追风丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "中国脑中使用的药品种类及其主要草药成分有哪些呢？",
        "input": "",
        "output": "match (n {name: '中国脑'})<-[r:分类]-(m)-[r1:主要成分]->(k)   return n,m,k;"
    },
    {
        "instruction": "咳喘宁的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '咳喘宁' }) return n.character;"
    },
    {
        "instruction": "能否全面阐述清凉油的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '清凉油' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请列出心痛宁滴丸禁用的情况。",
        "input": "",
        "output": "match (n:药品 { name: '心痛宁滴丸' }) return n.taboo;"
    },
    {
        "instruction": "能详细说一下清瘟解毒片的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '清瘟解毒片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "禁忌事项是七制香附丸需要注意的使用限制，具体包括哪些内容呢？",
        "input": "",
        "output": "match (n:药品 { name: '七制香附丸' }) return n.taboo;"
    },
    {
        "instruction": "胃安胶囊的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '胃安胶囊' }) return n.specifications;"
    },
    {
        "instruction": "禁忌事项为豨桐丸的使用限制或不适用情况，具体包括哪些内容需要查阅相关资料或咨询医生。",
        "input": "",
        "output": "match (n:药品 { name: '豨桐丸' }) return n.taboo;"
    },
    {
        "instruction": "开胸消食片的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '开胸消食片'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "能详细说一下泻白糖浆的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '泻白糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否介绍一下小儿导赤片的作用？类似功效的药品又有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '小儿导赤片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "鹿角可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '鹿角'} ) return  n"
    },
    {
        "instruction": "请提供胃康灵胶囊的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '胃康灵胶囊' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请介绍一下羊痫疯丸的药效，类似的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '羊痫疯丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "凉血祛风糖浆的辅料包含有以下成分：",
        "input": "",
        "output": "match (n:药品 { name: '凉血祛风糖浆' })-[r:辅料]->(m) return m; "
    },
    {
        "instruction": "催乳丸的主要成分包含哪些药材？",
        "input": "",
        "output": "match (n:药品 {name: '催乳丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "能详细说一下消炎解毒丸的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '消炎解毒丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否阐述一下安神补气丸的药理作用？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '安神补气丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否阐述一下清咽滴丸的药效？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '清咽滴丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "关于舒肝调气丸的特征信息，请您查收。",
        "input": "",
        "output": "match (n:药品 { name: '舒肝调气丸' }) return n.character;"
    },
    {
        "instruction": "注意事项请对羊痫疯丸进行详细阅读。",
        "input": "",
        "output": "match (n:药品 { name: '羊痫疯丸' }) return n.note;"
    },
    {
        "instruction": "请介绍一下安神补气丸的主要效果，另外，有哪些其他药品也有这样的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '安神补气丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下泻白糖浆的主要作用，另外还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '泻白糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说一下当归龙荟片的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '当归龙荟片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能告诉我五加皮酒药品的功效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '五加皮酒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "羚羊感冒片的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '羚羊感冒片' }) return n.specifications;"
    },
    {
        "instruction": "哪些药品可以使用淀粉酶？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '淀粉酶'} ) return  n"
    },
    {
        "instruction": "狗皮膏的辅料包含有",
        "input": "",
        "output": "match (n:药品 { name: '狗皮膏' })-[r:辅料]->(m) return m; "
    },
    {
        "instruction": "参苓白术片的包装规格是怎样的？",
        "input": "",
        "output": "match (n:药品 { name: '参苓白术片' }) return n.specifications;"
    },
    {
        "instruction": "能否介绍一下藿香正气水的药效？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '藿香正气水' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请阐述一下慢惊丸的主要作用，另外，有哪些其他药品也有类似功效呢？",
        "input": "",
        "output": "match (n:药品 { name: '慢惊丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下复方灵芝颗粒的主要效果，另外有哪些药品也有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '复方灵芝颗粒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否介绍一下黄连羊肝片的药效？还有其他什么药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '黄连羊肝片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "哪些药品可以使用熟地黄？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '熟地黄'} ) return  n"
    },
    {
        "instruction": "请问中国脑包含的药物种类和主要药材成分是什么？",
        "input": "",
        "output": "match (n {name: '中国脑'})<-[r:分类]-(m)-[r1:主要成分]->(k)   return n,m,k;"
    },
    {
        "instruction": "通宣理肺丸有什么作用？类似效果的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '通宣理肺丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "稻芽可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '稻芽'} ) return  n"
    },
    {
        "instruction": "清眩软胶囊的主要成分包括哪些药材？",
        "input": "",
        "output": "match (n:药品 {name: '清眩软胶囊'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "能详细说一下牛黄抱龙丸的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '牛黄抱龙丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说一下二母安嗽糖浆的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '二母安嗽糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否阐述一下二妙丸的主要作用？同类药品中有哪些也有这些效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '二妙丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "速效心痛滴丸的类型是属于什么？",
        "input": "",
        "output": "match (n:药品 { name: '速效心痛滴丸' })-[r:分类]->(m) return m;"
    },
    {
        "instruction": "清胃黄连片的全部资料是什么",
        "input": "",
        "output": "match (n:药品  { name: '清胃黄连片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "防风通圣丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '防风通圣丸' }) return n.specifications;"
    },
    {
        "instruction": "讨论一下锁阳固精丸的药品作用，还有其他什么药品有类似效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '锁阳固精丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下催乳丸的主要作用，另外还有哪些药品在这方面有相似效果？",
        "input": "",
        "output": "match (n:药品 { name: '催乳丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否介绍一下喉痛丸的药效？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '喉痛丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "跌打丸的主要成分包括哪些药材？",
        "input": "",
        "output": "match (n:药品 {name: '跌打丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "能否介绍一下追风丸的效果，还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '追风丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说说香苏正胃丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '香苏正胃丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "角鲨烯胶丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '角鲨烯胶丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "谈谈沉香舒郁片的作用，还有哪些药品有类似的功能呢？",
        "input": "",
        "output": "match (n:药品 { name: '沉香舒郁片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下华山参滴丸的药效，类似功能的药品又有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '华山参滴丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "婚酥可以用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '婚酥'} ) return  n"
    },
    {
        "instruction": "注意事项是针对止嗽定喘口服液的使用而提出的，具体内容可能包括服药期间的饮食禁忌、不适用人群、可能的副作用等，具体信息需要参考药品说明书或咨询医生。",
        "input": "",
        "output": "match (n:药品 { name: '止嗽定喘口服液' }) return n.note;"
    },
    {
        "instruction": "能否阐述一下二母安嗽糖浆的药理作用？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '二母安嗽糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "讨论一下羊痫疯丸的药品功效，有哪些其他药品也有同样或类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '羊痫疯丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "人参须可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '人参须'} ) return  n"
    },
    {
        "instruction": "请在使用追风活络酒时注意以下事项：",
        "input": "",
        "output": "match (n:药品 { name: '追风活络酒' }) return n.note;"
    },
    {
        "instruction": "能否阐述一下仙茸壮阳口服液的药品作用？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '仙茸壮阳口服液' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项请对七制香附丸进行查看。",
        "input": "",
        "output": "match (n:药品 { name: '七制香附丸' }) return n.note;"
    },
    {
        "instruction": "请介绍一下养血调经膏的主要作用，另外，有哪些其他药品也有这种调养作用？",
        "input": "",
        "output": "match (n:药品 { name: '养血调经膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说说消积化虫糖浆的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '消积化虫糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否分享一下香连丸的药效？类似效果的药品有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '香连丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说一下导赤丸的药效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '导赤丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "老鹳草可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '老鹳草'} ) return  n"
    },
    {
        "instruction": "能告诉我胃肠安丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '胃肠安丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "药品中可以使用酵母粉作为成分的有哪些？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '酵母粉'} ) return  n"
    },
    {
        "instruction": "请介绍一下京万红痔疮膏的功效，另外，有哪些其他药品也有同样的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '京万红痔疮膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请注意清胃黄连片的使用注意事项。",
        "input": "",
        "output": "match (n:药品 { name: '清胃黄连片' }) return n.note;"
    },
    {
        "instruction": "能详细说说妙灵丸的效果吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '妙灵丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否详细说说温经丸的功效？还有其他什么药品有类似效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '温经丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否介绍一下西黄丸的功效？类似作用的药品又有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '西黄丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否介绍一下小儿清解颗粒的功效？类似功效的药品又有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '小儿清解颗粒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "西青果可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '西青果'} ) return  n"
    },
    {
        "instruction": "请介绍一下清瘟解毒片的功效，另外，有哪些其他药品也有类似的作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '清瘟解毒片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否分享一下京万红痔疮膏的治疗效果？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '京万红痔疮膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "需要获取消瘿五海丸的全部详细信息",
        "input": "",
        "output": "match (n:药品  { name: '消瘿五海丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请问数据库中存储的关系数据条数是多少呢？",
        "input": "",
        "output": "match (n )-[r]->(m) return count(*);"
    },
    {
        "instruction": "能详细说一下六经头痛片的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '六经头痛片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否阐述催乳丸的药理作用？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '催乳丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "介绍一下参苓白术片的主要作用，还有哪些药品在这方面有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '参苓白术片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "禁忌事项是人参再造丸的重要内容，需要详细了解。",
        "input": "",
        "output": "match (n:药品 { name: '人参再造丸' }) return n.taboo;"
    },
    {
        "instruction": "能否详细描述一下紫龙金片的药效，并列出其他具有类似作用的药品名字？",
        "input": "",
        "output": "match (n:药品 { name: '紫龙金片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否详细描述一下治红丸的药效，并给出其他具有类似效果的药品名字？",
        "input": "",
        "output": "match (n:药品 { name: '治红丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "三七可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '三七'} ) return  n"
    },
    {
        "instruction": "能详细说一下小儿导赤片的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '小儿导赤片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "我想了解一下通宣理肺丸的功效，以及类似的药品名，能告诉我吗？",
        "input": "",
        "output": "match (n:药品 { name: '通宣理肺丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请注意催乳丸的使用注意事项。",
        "input": "",
        "output": "match (n:药品 { name: '催乳丸' }) return n.note;"
    },
    {
        "instruction": "能详细说一下八宝坤顺丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '八宝坤顺丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能告诉我清胃黄连片的功效吗？还有其他什么药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '清胃黄连片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说一下通脉养心口服液的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '通脉养心口服液' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "荆芥可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '荆芥'} ) return  n"
    },
    {
        "instruction": "能详细说一下参苓白术片的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '参苓白术片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项是针对清心牛黄片的使用所提出的提示。",
        "input": "",
        "output": "match (n:药品 { name: '清心牛黄片' }) return n.note;"
    },
    {
        "instruction": "请介绍一下补益地黄丸的功效，另外，有哪些其他药品也有类似的作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '补益地黄丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "讨论一下内消瘰疬丸的功效，还有其他药品中哪些也具有类似效果？",
        "input": "",
        "output": "match (n:药品 { name: '内消瘰疬丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "栀子金花丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '栀子金花丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    }
]