[
    {
        "instruction": "请提供关于催乳丸的详尽信息",
        "input": "",
        "output": "match (n:药品  { name: '催乳丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "可用于哪些药品的豨莶草",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '豨益草'} ) return  n"
    },
    {
        "instruction": "提供孕妇金花片的注意事项",
        "input": "",
        "output": "match (n:药品 { name: '孕妇金花片' }) return n.note;"
    },
    {
        "instruction": "哪些药品可以使用莲子心作为成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '莲子心'} ) return  n"
    },
    {
        "instruction": "注意事项是针对槟榔四消片的使用所提出的提示，可能包括禁忌症、副作用、用药指导等重要信息。请仔细阅读并遵循医生或药师的建议。",
        "input": "",
        "output": "match (n:药品 { name: '槟榔四消片' }) return n.note;"
    },
    {
        "instruction": "请介绍一下二妙丸的药效，类似效果的药品又有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '二妙丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "需要提供清金止嗽化痰丸的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '清金止嗽化痰丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请介绍一下羚羊感冒胶囊的药效，类似的药品还有哪些？",
        "input": "",
        "output": "match (n:药品 { name: '羚羊感冒胶囊' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下橡皮生肌膏的主要作用，另外，有哪些其他药品也有类似疗效呢？",
        "input": "",
        "output": "match (n:药品 { name: '橡皮生肌膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "我想了解六味地黄丸的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '六味地黄丸' }) return n.specifications;"
    },
    {
        "instruction": "关于通宣理肺丸，我需要你提供其主要特征和信息。",
        "input": "",
        "output": "match (n:药品 { name: '通宣理肺丸' }) return n.character;"
    },
    {
        "instruction": "清咽丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '清咽丸' }) return n.specifications;"
    },
    {
        "instruction": "关于橡皮生肌膏，请给予完整的信息描述",
        "input": "",
        "output": "match (n:药品  { name: '橡皮生肌膏' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "列出所有关于风湿关节炎片的信息详情",
        "input": "",
        "output": "match (n:药品  { name: '风湿关节炎片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "我想了解六经头痛片的包装信息，能告诉我吗？",
        "input": "",
        "output": "match (n:药品 { name: '六经头痛片' }) return n.specifications;"
    },
    {
        "instruction": "请介绍一下清宁丸的主要作用，另外还有哪些药品具有类似的功能呢？",
        "input": "",
        "output": "match (n:药品 { name: '清宁丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "禁忌事项是艾附暖宫丸的重要内容，需要详细了解。",
        "input": "",
        "output": "match (n:药品 { name: '艾附暖宫丸' }) return n.taboo;"
    },
    {
        "instruction": "玄归滴丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '玄归滴丸' }) return n.specifications;"
    },
    {
        "instruction": "零陵香可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '零陵香'} ) return  n"
    },
    {
        "instruction": "国公酒的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '国公酒' }) return n.specifications;"
    },
    {
        "instruction": "能详细说一下良附丸的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '良附丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "金匮肾气丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '金匮肾气丸' }) return n.specifications;"
    },
    {
        "instruction": "请提供关于孕妇金花丸的特性详情。",
        "input": "",
        "output": "match (n:药品 { name: '孕妇金花丸' }) return n.character;"
    },
    {
        "instruction": "能否详细描述一下百效丸的药效，并列出其他具有类似作用的药品名字？",
        "input": "",
        "output": "match (n:药品 { name: '百效丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "鹿茸(去毛)可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '鹿茸(去毛)'} ) return  n"
    },
    {
        "instruction": "请告诉我复方蟾酥丸的禁忌有哪些",
        "input": "",
        "output": "match (n:药品 { name: '复方蟾酥丸' }) return n.taboo;"
    },
    {
        "instruction": "心脑静片的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '心脑静片' }) return n.specifications;"
    },
    {
        "instruction": "能否阐述一下导赤丸的药品功效？还有没有其他药品具有类似功能？",
        "input": "",
        "output": "match (n:药品 { name: '导赤丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "提供一粒珠的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '一粒珠' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能告诉我泻痢固肠片的功效吗？还有其他什么药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '泻痢固肠片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否介绍一下顽癣敌软膏的功效？有没有其他药品也有类似治疗作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '顽癣敌软膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "对于怕冷的情况，你是否需要我推荐一些药品？",
        "input": "",
        "output": "match (n:药品)-[r:适应症状]->(m :症状 { name : '怕冷' }) return   n ;"
    },
    {
        "instruction": "对于参苓白术丸的使用，需要注意以下几点：",
        "input": "",
        "output": "match (n:药品 { name: '参苓白术丸' }) return n.note;"
    },
    {
        "instruction": "请问气管炎丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '气管炎丸' }) return n.specifications;"
    },
    {
        "instruction": "能详细说一下心痛宁滴丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '心痛宁滴丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项是针对艾附暖宫丸的使用所提出的提示，可能包括服药时间、剂量、禁忌症、副作用等信息。例如：使用艾附暖宫丸时，应注意按照医生的指示服用，不可超量使用；孕妇和哺乳期妇女应避免使用；如果在使用过程中出现过敏反应或其他不适，应立即停药并就医。这些注意事项有助于确保药物的安全有效使用。",
        "input": "",
        "output": "match (n:药品 { name: '艾附暖宫丸' }) return n.note;"
    },
    {
        "instruction": "哪些药品可以使用醋五味子作为成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '醋五味子'} ) return  n"
    },
    {
        "instruction": "百效丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '百效丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "禁忌事项是木香分气丸使用时需要注意的事项，具体包括哪些内容呢？",
        "input": "",
        "output": "match (n:药品 { name: '木香分气丸' }) return n.taboo;"
    },
    {
        "instruction": "全面介绍香苏正胃丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '香苏正胃丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "朴沉化郁丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '朴沉化郁丸' }) return n.specifications;"
    },
    {
        "instruction": "能否告知七珍丸的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '七珍丸' }) return n.specifications;"
    },
    {
        "instruction": "注意事项是针对八珍益母丸的使用所提出的提示。",
        "input": "",
        "output": "match (n:药品 { name: '八珍益母丸' }) return n.note;"
    },
    {
        "instruction": "提供三鞭酒的禁用情况",
        "input": "",
        "output": "match (n:药品 { name: '三鞭酒' }) return n.taboo;"
    },
    {
        "instruction": "能否告知养阴清肺膏的包装大小或容量信息？",
        "input": "",
        "output": "match (n:药品 { name: '养阴清肺膏' }) return n.specifications;"
    },
    {
        "instruction": "关于桑菊感冒片，我需要你提供其主要特征和信息。",
        "input": "",
        "output": "match (n:药品 { name: '桑菊感冒片' }) return n.character;"
    },
    {
        "instruction": "玄归滴丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '玄归滴丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "禁忌症对于六经头痛片是重要的信息，需要明确了解。",
        "input": "",
        "output": "match (n:药品 { name: '六经头痛片' }) return n.taboo;"
    },
    {
        "instruction": "注意事项需要对六经头痛片进行提供。",
        "input": "",
        "output": "match (n:药品 { name: '六经头痛片' }) return n.note;"
    },
    {
        "instruction": "能详细说一下养胃片的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '养胃片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请阐述锁阳固精丸的功效，同时列举几个同类药品的名称。",
        "input": "",
        "output": "match (n:药品 { name: '锁阳固精丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "安宫牛黄丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '安宫牛黄丸' }) return n.specifications;"
    },
    {
        "instruction": "请介绍一下妙灵丸药品的功效，类似的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '妙灵丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "药品中可以使用象皮(制)作为成分。",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '象皮(制)'} ) return  n"
    },
    {
        "instruction": "能详细说一下风湿酒药品的作用吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '风湿酒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请注意舒筋丸的使用注意事项。",
        "input": "",
        "output": "match (n:药品 { name: '舒筋丸' }) return n.note;"
    },
    {
        "instruction": "你需要我提供七制香附丸的详细信息，请问有哪些具体方面你想要了解的？",
        "input": "",
        "output": "match (n:药品  { name: '七制香附丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请介绍一下清咽滴丸的主要效果，另外，有哪些其他药品也有相同或相似的疗效呢？",
        "input": "",
        "output": "match (n:药品 { name: '清咽滴丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请提供六味地黄片的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '六味地黄片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否详细描述一下清宁丸的药效？类似效果的药品又有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '清宁丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请注意茴香橘核丸的禁忌",
        "input": "",
        "output": "match (n:药品 { name: '茴香橘核丸' }) return n.taboo;"
    },
    {
        "instruction": "请注意黄连上清片的用法用量",
        "input": "",
        "output": "match (n:药品 { name: '黄连上清片' }) return n.note;"
    },
    {
        "instruction": "请告诉我六灵丸的包装规格。",
        "input": "",
        "output": "match (n:药品 { name: '六灵丸' }) return n.specifications;"
    },
    {
        "instruction": "请提供百效丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '百效丸' }) return n.specifications;"
    },
    {
        "instruction": "对于牙龈肿痛，你寻求药品推荐，可以考虑咨询专业人士或查看相关药品信息。",
        "input": "",
        "output": "match (n:药品)-[r:适应症状]->(m :症状 { name : '牙龈肿痛' }) return   n ;"
    },
    {
        "instruction": "全面介绍心痛宁滴丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '心痛宁滴丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请提供洋参保肺丸的详细特性",
        "input": "",
        "output": "match (n:药品 { name: '洋参保肺丸' }) return n.character;"
    },
    {
        "instruction": "能否介绍一下清热丸的功效？类似作用的药品又有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '清热丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "再造丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '再造丸' }) return n.specifications;"
    },
    {
        "instruction": "清心牛黄片的禁忌事项需要给出。",
        "input": "",
        "output": "match (n:药品 { name: '清心牛黄片' }) return n.taboo;"
    },
    {
        "instruction": "能详细描述一下越鞠保和丸的药效吗？另外，还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '越鞠保和丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说一下二陈丸药品的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '二陈丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请注意，关于愈风宁心片的使用，有以下注意事项需要遵守：",
        "input": "",
        "output": "match (n:药品 { name: '愈风宁心片' }) return n.note;"
    },
    {
        "instruction": "能否详细描述一下脉络通的包装大小或形式？",
        "input": "",
        "output": "match (n:药品 { name: '脉络通' }) return n.specifications;"
    },
    {
        "instruction": "提供关于癃清片的特征详情",
        "input": "",
        "output": "match (n:药品 { name: '癃清片' }) return n.character;"
    },
    {
        "instruction": "万氏牛黄清心丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '万氏牛黄清心丸' }) return n.specifications;"
    },
    {
        "instruction": "注意事项请对牛黄上清片进行查看。",
        "input": "",
        "output": "match (n:药品 { name: '牛黄上清片' }) return n.note;"
    },
    {
        "instruction": "参茸酒的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '参茸酒' }) return n.character;"
    },
    {
        "instruction": "请提供长城止咳喘糖浆的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '长城止咳喘糖浆' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请列举小儿止嗽丸的全部详情",
        "input": "",
        "output": "match (n:药品  { name: '小儿止嗽丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "提供牛黄抱龙丸的全面资料。",
        "input": "",
        "output": "match (n:药品  { name: '牛黄抱龙丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "脉络通的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '脉络通'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "桑菊感冒糖浆的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '桑菊感冒糖浆'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "养血安神片的注意事项需要被提供。",
        "input": "",
        "output": "match (n:药品 { name: '养血安神片' }) return n.note;"
    },
    {
        "instruction": "请提供桑菊感冒片的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '桑菊感冒片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "补益地黄丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '补益地黄丸' }) return n.specifications;"
    },
    {
        "instruction": "四季三黄片的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '四季三黄片'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "人参鹿茸丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '人参鹿茸丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "能否告知阳和解凝膏的包装规格？",
        "input": "",
        "output": "match (n:药品 { name: '阳和解凝膏' }) return n.specifications;"
    },
    {
        "instruction": "速效救心丸的禁忌事项需要给出。",
        "input": "",
        "output": "match (n:药品 { name: '速效救心丸' }) return n.taboo;"
    },
    {
        "instruction": "热毒平颗粒的全部详情是什么",
        "input": "",
        "output": "match (n:药品  { name: '热毒平颗粒' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "哪些药品可以使用砂仁作为成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '砂仁'} ) return  n"
    },
    {
        "instruction": "请详细描述一下五加皮酒的药用价值，另外，有哪些其他药品也有类似的作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '五加皮酒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否介绍一下羊痫疯癫丸的药效？并提供一些具有类似效果的药品名字。",
        "input": "",
        "output": "match (n:药品 { name: '羊痫疯癫丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说说茵陈酒的药效吗？还有哪些药品有相似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '茵陈酒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请问舒肝调气丸的包装规格是怎样的？",
        "input": "",
        "output": "match (n:药品 { name: '舒肝调气丸' }) return n.specifications;"
    },
    {
        "instruction": "我想了解调胃丹的包装大小和规格",
        "input": "",
        "output": "match (n:药品 { name: '调胃丹' }) return n.specifications;"
    },
    {
        "instruction": "请告诉我人参归脾丸的禁忌使用情况",
        "input": "",
        "output": "match (n:药品 { name: '人参归脾丸' }) return n.taboo;"
    },
    {
        "instruction": "止嗽青果丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '止嗽青果丸' }) return n.specifications;"
    },
    {
        "instruction": "能否阐述一下橡皮生肌膏药品的功效？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '橡皮生肌膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "提供一下童宝乐片禁用的情况",
        "input": "",
        "output": "match (n:药品 { name: '童宝乐片' }) return n.taboo;"
    },
    {
        "instruction": "能否阐述一下大黄䗪虫丸的药理作用？还有没有其他药品有类似效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '大黄䗪虫丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "特征信息如下：通经甘露丸。",
        "input": "",
        "output": "match (n:药品 { name: '通经甘露丸' }) return n.character;"
    },
    {
        "instruction": "阐明癃清片禁用的特殊情况。",
        "input": "",
        "output": "match (n:药品 { name: '癃清片' }) return n.taboo;"
    },
    {
        "instruction": "给出长城感冒片的全面介绍",
        "input": "",
        "output": "match (n:药品  { name: '长城感冒片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请介绍一下黑锡丹的功效，另外，有哪些其他药品也有类似的作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '黑锡丹' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否告知二母安嗽片的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '二母安嗽片' }) return n.specifications;"
    },
    {
        "instruction": "讨论一下复方丹参片的药品作用，还有其他什么药品具有相似的功效呢？",
        "input": "",
        "output": "match (n:药品 { name: '复方丹参片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请阐述内消瘰疬片的主要作用，同时给出其他具有类似作用的药品名。",
        "input": "",
        "output": "match (n:药品 { name: '内消瘰疬片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "京万红痔疮膏的特征信息可以详细说明一下吗？",
        "input": "",
        "output": "match (n:药品 { name: '京万红痔疮膏' }) return n.character;"
    },
    {
        "instruction": "大枣(去核)可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '大枣(去核)'} ) return  n"
    },
    {
        "instruction": "能详细说一下华山参滴丸的效果吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '华山参滴丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说一下六味地黄胶囊的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '六味地黄胶囊' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "人参是可用于哪些药品的成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '人参'} ) return  n"
    },
    {
        "instruction": "请描述一下双氯芬酸钠缓释片（V）的疗效。",
        "input": "",
        "output": "match (n:药品 { name: '双氯芬酸钠缓释片（V）' })-[r:作用功效]->(m) return m;"
    },
    {
        "instruction": "介绍一下长城感冒片的功效，另外有哪些药品在这方面表现相似？",
        "input": "",
        "output": "match (n:药品 { name: '长城感冒片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说一下养血调经膏的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '养血调经膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说一下金匮肾气丸的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '金匮肾气丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "禁忌事项是牛黄抱龙丸的重要内容，需要详细了解。",
        "input": "",
        "output": "match (n:药品 { name: '牛黄抱龙丸' }) return n.taboo;"
    },
    {
        "instruction": "禁忌事项为乌金丸的使用限制或不建议情况，具体包括哪些内容需要查阅相关资料或咨询医生。",
        "input": "",
        "output": "match (n:药品 { name: '乌金丸' }) return n.taboo;"
    },
    {
        "instruction": "你能告诉我数据库中有多少种不同的辅料吗？",
        "input": "",
        "output": "match (n:辅料 ) return count(*);"
    },
    {
        "instruction": "固肠胶囊的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '固肠胶囊'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "讨论一下少腹逐瘀丸的功效，同时列举几个具有相似功效的药品",
        "input": "",
        "output": "match (n:药品 { name: '少腹逐瘀丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "查询龙胆泻肝丸的所有详细信息",
        "input": "",
        "output": "match (n:药品  { name: '龙胆泻肝丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否介绍一下消炎解毒丸的功效？类似作用的药品又有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '消炎解毒丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "关于女金片的详细信息，请您查看。",
        "input": "",
        "output": "match (n:药品  { name: '女金片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "禁忌症包括对愈风宁心片任何成分过敏者，孕妇，哺乳期妇女，儿童，老年人等特殊人群慎用，具体请遵医嘱。",
        "input": "",
        "output": "match (n:药品 { name: '愈风宁心片' }) return n.taboo;"
    },
    {
        "instruction": "能否告知豨莶液的包装详情",
        "input": "",
        "output": "match (n:药品 { name: '豨莶液' }) return n.specifications;"
    },
    {
        "instruction": "能否阐述一下益肾糖浆的主要作用？还有没有其他药品在这方面表现相似？",
        "input": "",
        "output": "match (n:药品 { name: '益肾糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "在服用止红肠辟丸时，请务必遵照医生的指示。",
        "input": "",
        "output": "match (n:药品 { name: '止红肠辟丸' }) return n.note;"
    },
    {
        "instruction": "消积化虫糖浆的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '消积化虫糖浆'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "海蛆可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '海蛆'} ) return  n"
    },
    {
        "instruction": "请介绍一下沉香舒郁片的功效，还有其他什么药品有类似效果？",
        "input": "",
        "output": "match (n:药品 { name: '沉香舒郁片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "樟脑油可以用在哪些药品中？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '樟脑油'} ) return  n"
    },
    {
        "instruction": "禁忌事项对于消瘿五海丸是重要的信息，需要明确了解。",
        "input": "",
        "output": "match (n:药品 { name: '消瘿五海丸' }) return n.taboo;"
    },
    {
        "instruction": "禁忌事项是小儿琥珀丸的重要内容，需要详细了解。",
        "input": "",
        "output": "match (n:药品 { name: '小儿琥珀丸' }) return n.taboo;"
    },
    {
        "instruction": "济坤丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '济坤丸' }) return n.specifications;"
    },
    {
        "instruction": "禁忌症包括对金芪降糖片任何成分过敏者，严重肝肾功能不全者，孕妇及哺乳期妇女，儿童等，请在医生指导下使用。",
        "input": "",
        "output": "match (n:药品 { name: '金芪降糖片' }) return n.taboo;"
    },
    {
        "instruction": "请介绍一下香苏正胃丸的药效，另外有哪些药品也有相同或类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '香苏正胃丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "详细描述一下人参再造丸的特性",
        "input": "",
        "output": "match (n:药品 { name: '人参再造丸' }) return n.character;"
    },
    {
        "instruction": "请介绍一下当归龙荟片的主要作用，另外还有哪些药品具有类似的功能？",
        "input": "",
        "output": "match (n:药品 { name: '当归龙荟片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请提供香砂六君丸的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '香砂六君丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "四神片的辅料成分包括有哪些？",
        "input": "",
        "output": "match (n:药品 { name: '四神片' })-[r:辅料]->(m) return m; "
    },
    {
        "instruction": "再造丸的主要成分包括哪些药材？",
        "input": "",
        "output": "match (n:药品 {name: '再造丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "能否详细描述一下百补增力丸的效果，并列出其他具有类似作用的药品名字？",
        "input": "",
        "output": "match (n:药品 { name: '百补增力丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "海螵蛸(去壳)是哪些药品的成分？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '海螵蛸(去壳)'} ) return  n"
    },
    {
        "instruction": "请问风湿酒的包装大小是多少？",
        "input": "",
        "output": "match (n:药品 { name: '风湿酒' }) return n.specifications;"
    },
    {
        "instruction": "请提供一粒珠的包装尺寸信息。",
        "input": "",
        "output": "match (n:药品 { name: '一粒珠' }) return n.specifications;"
    },
    {
        "instruction": "请介绍一下角鲨烯胶丸的药效，类似的药品还有哪些？",
        "input": "",
        "output": "match (n:药品 { name: '角鲨烯胶丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "桑菊感冒片的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '桑菊感冒片'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "抗腮灵糖浆的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '抗腮灵糖浆'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "女金丸的使用禁忌包括：对本品任何成分过敏的女性禁用。",
        "input": "",
        "output": "match (n:药品 { name: '女金丸' }) return n.taboo;"
    },
    {
        "instruction": "能否全面介绍消炎解毒丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '消炎解毒丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否介绍一下益肺清化膏的主要作用，并给出其他具有类似效果的药品名字？",
        "input": "",
        "output": "match (n:药品 { name: '益肺清化膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项如下：请在使用橡皮生肌膏时仔细阅读说明书；避免接触眼睛；如果出现过敏反应，请立即停用。",
        "input": "",
        "output": "match (n:药品 { name: '橡皮生肌膏' }) return n.note;"
    },
    {
        "instruction": "注意事项请给出豨桐丸的",
        "input": "",
        "output": "match (n:药品 { name: '豨桐丸' }) return n.note;"
    },
    {
        "instruction": "能否介绍一下槟榔四消片的药效？类似效果的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '槟榔四消片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "白及可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '白及'} ) return  n"
    },
    {
        "instruction": "请提供橘红化痰丸的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '橘红化痰丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请阐述一下参苓白术片的药理作用，另外，有哪些其他药品也有类似的功能呢？",
        "input": "",
        "output": "match (n:药品 { name: '参苓白术片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否提供枳术丸的包装详情？",
        "input": "",
        "output": "match (n:药品 { name: '枳术丸' }) return n.specifications;"
    },
    {
        "instruction": "禁忌症包括但不限于：对催乳丸任何成分过敏者；怀孕或哺乳期妇女；有严重肝肾疾病患者；未经医生指导，请勿使用催乳丸。",
        "input": "",
        "output": "match (n:药品 { name: '催乳丸' }) return n.taboo;"
    },
    {
        "instruction": "请告知四季三黄丸的禁忌事项和注意事项",
        "input": "",
        "output": "match (n:药品 { name: '四季三黄丸' }) return n.taboo;"
    },
    {
        "instruction": "能告诉我使用胃安胶囊需要注意什么吗？",
        "input": "",
        "output": "match (n:药品 { name: '胃安胶囊' }) return n.note;"
    },
    {
        "instruction": "能否阐述一下泻白糖浆的药理作用？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '泻白糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下牛黄抱龙丸的功效，另外，有哪些其他药品也有类似的作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '牛黄抱龙丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请问启脾丸的包装规格是怎样的？",
        "input": "",
        "output": "match (n:药品 { name: '启脾丸' }) return n.specifications;"
    },
    {
        "instruction": "能详细说一下小儿增食丸的效果吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '小儿增食丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "全面介绍痹祺胶囊的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '痹祺胶囊' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否告知通脉颗粒的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '通脉颗粒' }) return n.specifications;"
    },
    {
        "instruction": "全面介绍舒筋丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '舒筋丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "药品可以使用棕板(炭)作为原料或成分。",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '棕板(炭)'} ) return  n"
    },
    {
        "instruction": "禁忌事项如下：慢惊丸禁用于对该药品过敏的患者，孕妇和哺乳期妇女慎用。",
        "input": "",
        "output": "match (n:药品 { name: '慢惊丸' }) return n.taboo;"
    },
    {
        "instruction": "华山参滴丸有哪些功效呢？类似效果的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '华山参滴丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下益肾糖浆的功效，另外，有哪些其他药品也有同样或类似的作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '益肾糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "心可宁胶囊的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '心可宁胶囊' }) return n.specifications;"
    },
    {
        "instruction": "我想了解一下止嗽定喘口服液的功效，同时，能否推荐一些具有相似药效的药品？",
        "input": "",
        "output": "match (n:药品 { name: '止嗽定喘口服液' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说说顽癣敌软膏的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '顽癣敌软膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "药品中可以使用百部(蜜炙)作为成分。",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '百部(蜜炙)'} ) return  n"
    },
    {
        "instruction": "请注意华山参滴丸的注意事项。",
        "input": "",
        "output": "match (n:药品 { name: '华山参滴丸' }) return n.note;"
    },
    {
        "instruction": "芎菊上清丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '芎菊上清丸' }) return n.specifications;"
    },
    {
        "instruction": "八珍益母丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '八珍益母丸' }) return n.specifications;"
    },
    {
        "instruction": "能否介绍一下消积化虫糖浆的作用？类似功效的药品又有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '消积化虫糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "对于因中风痰厥导致的瘫痪，有什么药品可以推荐？",
        "input": "",
        "output": "match (n:药品)-[r:适应症状]->(m :症状 { name : '中风痰厥引起的瘫痪' }) return   n ;"
    },
    {
        "instruction": "能告诉我清宁丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '清宁丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    }
]