[
    {
        "instruction": "以下是复方蟾酥丸所使用的部分辅料：",
        "input": "",
        "output": "match (n:药品 { name: '复方蟾酥丸' })-[r:辅料]->(m) return m; "
    },
    {
        "instruction": "请介绍一下胃痛定的主要功效，同时列举一些具有相似药效的药品名字。",
        "input": "",
        "output": "match (n:药品 { name: '胃痛定' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项如下：\n1. 女金片不适合所有人，如有特殊疾病或过敏情况，请在使用前咨询医生。\n2. 请按照说明书的指示使用，不要随意增减剂量。\n3. 孕妇和哺乳期妇女在使用女金片前，应先获得医生的建议。",
        "input": "",
        "output": "match (n:药品 { name: '女金片' }) return n.note;"
    },
    {
        "instruction": "请提供上清丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '上清丸' }) return n.specifications;"
    },
    {
        "instruction": "香连丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '香连丸' }) return n.specifications;"
    },
    {
        "instruction": "能详细说一下西黄丸的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '西黄丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否介绍一下止嗽定喘口服液的药效？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '止嗽定喘口服液' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下导赤丸的功效，以及其它具有类似效果的药品名",
        "input": "",
        "output": "match (n:药品 { name: '导赤丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请提供羚羊感冒胶囊的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '羚羊感冒胶囊' }) return n.specifications;"
    },
    {
        "instruction": "能否告知得生片的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '得生片' }) return n.specifications;"
    },
    {
        "instruction": "胃安胶囊的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '胃安胶囊' }) return n.character;"
    },
    {
        "instruction": "能否提供四神片的包装详情？",
        "input": "",
        "output": "match (n:药品 { name: '四神片' }) return n.specifications;"
    },
    {
        "instruction": "我想了解胃肠安丸的包装规格，请告诉我",
        "input": "",
        "output": "match (n:药品 { name: '胃肠安丸' }) return n.specifications;"
    },
    {
        "instruction": "请提供脑立清片的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '脑立清片' }) return n.specifications;"
    },
    {
        "instruction": "请问五味子丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '五味子丸' }) return n.specifications;"
    },
    {
        "instruction": "请提供追风片的包装规格信息。",
        "input": "",
        "output": "match (n:药品 { name: '追风片' }) return n.specifications;"
    },
    {
        "instruction": "全面阐述养胃片的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '养胃片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请提供纯阳正气丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '纯阳正气丸' }) return n.specifications;"
    },
    {
        "instruction": "请问愈风丹的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '愈风丹' }) return n.specifications;"
    },
    {
        "instruction": "羚羊感冒片的特性信息能列举一下吗？",
        "input": "",
        "output": "match (n:药品 { name: '羚羊感冒片' }) return n.character;"
    },
    {
        "instruction": "能提供二陈丸的包装信息吗？",
        "input": "",
        "output": "match (n:药品 { name: '二陈丸' }) return n.specifications;"
    },
    {
        "instruction": "药品中哪些会用到海带？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '海带'} ) return  n"
    },
    {
        "instruction": "请提供羚羊感冒胶囊的详细特性",
        "input": "",
        "output": "match (n:药品 { name: '羚羊感冒胶囊' }) return n.character;"
    },
    {
        "instruction": "全面阐述茴香橘核丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '茴香橘核丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请提供风湿液的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '风湿液' }) return n.specifications;"
    },
    {
        "instruction": "养血调经膏的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '养血调经膏' }) return n.specifications;"
    },
    {
        "instruction": "我想了解六合定中丸的包装规格是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '六合定中丸' }) return n.specifications;"
    },
    {
        "instruction": "能否提供止嗽定喘口服液的禁忌使用情况？",
        "input": "",
        "output": "match (n:药品 { name: '止嗽定喘口服液' }) return n.taboo;"
    },
    {
        "instruction": "注意事项如下：请在使用慢惊丸时，务必遵医嘱，不可随意增减剂量或停药；同时，注意观察身体反应，如出现不适，应立即停药并就医。",
        "input": "",
        "output": "match (n:药品 { name: '慢惊丸' }) return n.note;"
    },
    {
        "instruction": "描述一下健脾片的特性详情",
        "input": "",
        "output": "match (n:药品 { name: '健脾片' }) return n.character;"
    },
    {
        "instruction": "请告诉我关于长城感冒片的禁忌事项。",
        "input": "",
        "output": "match (n:药品 { name: '长城感冒片' }) return n.taboo;"
    },
    {
        "instruction": "能否给出复方蟾酥丸的特性描述？",
        "input": "",
        "output": "match (n:药品 { name: '复方蟾酥丸' }) return n.character;"
    },
    {
        "instruction": "请问紫龙金片的包装规格是怎样的？",
        "input": "",
        "output": "match (n:药品 { name: '紫龙金片' }) return n.specifications;"
    },
    {
        "instruction": "关于一粒珠，我需要你提供一些使用时的注意事项。",
        "input": "",
        "output": "match (n:药品 { name: '一粒珠' }) return n.note;"
    },
    {
        "instruction": "请介绍一下复方丹参片的功效，另外，有哪些其他药品也有类似的作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '复方丹参片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说说羊痫疯丸的效果吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '羊痫疯丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否分享一下消积化滞片的作用？类似效果的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '消积化滞片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "角鲨烯胶丸有什么作用？有没有其他药品也有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '角鲨烯胶丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下百补增力丸的主要功效，同时提供一些具有类似效果的药品名作为参考。",
        "input": "",
        "output": "match (n:药品 { name: '百补增力丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项请给出长城感冒片的",
        "input": "",
        "output": "match (n:药品 { name: '长城感冒片' }) return n.note;"
    },
    {
        "instruction": "关于七制香附丸的全部详情，比如其功效、组成、使用方法等，你是否有特定的查询需求？",
        "input": "",
        "output": "match (n:药品  { name: '七制香附丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否全面介绍喉痛丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '喉痛丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否阐述一下金匮肾气丸的药品作用？类似功效的药品有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '金匮肾气丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请提供复方百部止咳糖浆的详细信息",
        "input": "",
        "output": "match (n:药品  { name: '复方百部止咳糖浆' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "告诉我止嗽定喘片的功效，还有其他什么药品可以达到类似治疗效果？",
        "input": "",
        "output": "match (n:药品 { name: '止嗽定喘片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "我想了解消炎解毒丸的使用禁忌和注意事项，能给我总结一下吗？",
        "input": "",
        "output": "match (n:药品 { name: '消炎解毒丸' }) return n.note;"
    },
    {
        "instruction": "请问愈风宁心片的包装规格是怎样的？",
        "input": "",
        "output": "match (n:药品 { name: '愈风宁心片' }) return n.specifications;"
    },
    {
        "instruction": "阐述芎菊上清丸的主要特性",
        "input": "",
        "output": "match (n:药品 { name: '芎菊上清丸' }) return n.character;"
    },
    {
        "instruction": "我想了解一下五加皮酒的药效，同时，能否列举一些具有相似药效的药品名字？",
        "input": "",
        "output": "match (n:药品 { name: '五加皮酒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "注意事项是针对木香分气丸的使用而提出的，具体内容可能包括服药期间的饮食禁忌、不适用人群、可能产生的副作用以及特殊情况下的用药指导等。请仔细阅读并遵照医嘱使用。",
        "input": "",
        "output": "match (n:药品 { name: '木香分气丸' }) return n.note;"
    },
    {
        "instruction": "请列举一下附桂紫金膏的主要特点。",
        "input": "",
        "output": "match (n:药品 { name: '附桂紫金膏' }) return n.character;"
    },
    {
        "instruction": "请告诉我人参鹿茸丸的包装大小和规格信息。",
        "input": "",
        "output": "match (n:药品 { name: '人参鹿茸丸' }) return n.specifications;"
    },
    {
        "instruction": "特征信息如下：五仁润肠丸",
        "input": "",
        "output": "match (n:药品 { name: '五仁润肠丸' }) return n.character;"
    },
    {
        "instruction": "禁忌事项对于洋参保肺丸很重要，请您了解。",
        "input": "",
        "output": "match (n:药品 { name: '洋参保肺丸' }) return n.taboo;"
    },
    {
        "instruction": "安坤赞育丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '安坤赞育丸' }) return n.specifications;"
    },
    {
        "instruction": "请告诉我天麻丸的禁忌事项。",
        "input": "",
        "output": "match (n:药品 { name: '天麻丸' }) return n.taboo;"
    },
    {
        "instruction": "请介绍一下养胃片的主要作用，另外，有哪些其他药品也有养胃的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '养胃片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请告诉我百花定喘片的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '百花定喘片' }) return n.specifications;"
    },
    {
        "instruction": "能否告知十香止痛丸的包装情况",
        "input": "",
        "output": "match (n:药品 { name: '十香止痛丸' }) return n.specifications;"
    },
    {
        "instruction": "以下是茵陈五疸丸的特征：",
        "input": "",
        "output": "match (n:药品 { name: '茵陈五疸丸' }) return n.character;"
    },
    {
        "instruction": "以下是胃痛定的主要特征：",
        "input": "",
        "output": "match (n:药品 { name: '胃痛定' }) return n.character;"
    },
    {
        "instruction": "请介绍一下人参再造丸的功效，另外，有哪些其他药品也有类似的作用呢？",
        "input": "",
        "output": "match (n:药品 { name: '人参再造丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "阐述复方灵芝颗粒的特征详情",
        "input": "",
        "output": "match (n:药品 { name: '复方灵芝颗粒' }) return n.character;"
    },
    {
        "instruction": "八宝坤顺丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '八宝坤顺丸' }) return n.specifications;"
    },
    {
        "instruction": "能否介绍一下慢惊丸的功效？类似效果的药品又有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '慢惊丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "哪些药品可以使用青果清膏？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '青果清膏'} ) return  n"
    },
    {
        "instruction": "我想了解杞菊地黄丸的包装情况，请告知",
        "input": "",
        "output": "match (n:药品 { name: '杞菊地黄丸' }) return n.specifications;"
    },
    {
        "instruction": "以下是参苓白术片的特征详情：",
        "input": "",
        "output": "match (n:药品 { name: '参苓白术片' }) return n.character;"
    },
    {
        "instruction": "祛暑露的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '祛暑露'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "查询清瘟解毒丸的详细信息。",
        "input": "",
        "output": "match (n:药品  { name: '清瘟解毒丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "全面介绍醒脑降压丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '醒脑降压丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "请列举小活络丸的全部详情",
        "input": "",
        "output": "match (n:药品  { name: '小活络丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "以下是舒脑欣滴丸的主要特性详情。",
        "input": "",
        "output": "match (n:药品 { name: '舒脑欣滴丸' }) return n.character;"
    },
    {
        "instruction": "我想了解补心片的包装规格是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '补心片' }) return n.specifications;"
    },
    {
        "instruction": "我想了解三黄丸的包装规格是怎样的",
        "input": "",
        "output": "match (n:药品 { name: '三黄丸' }) return n.specifications;"
    },
    {
        "instruction": "京万红软膏的辅料成分包括有哪些？",
        "input": "",
        "output": "match (n:药品 { name: '京万红软膏' })-[r:辅料]->(m) return m; "
    },
    {
        "instruction": "能否介绍一下茵陈酒的药品功效？类似功效的药品又有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '茵陈酒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下治红丸的主要作用，同时列举一些具有类似作用的药品名",
        "input": "",
        "output": "match (n:药品 { name: '治红丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "凉血祛风糖浆的主要成分包含哪些药材？",
        "input": "",
        "output": "match (n:药品 {name: '凉血祛风糖浆'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "请介绍一下八宝坤顺丸的主要效果，类似的药品还有哪些？",
        "input": "",
        "output": "match (n:药品 { name: '八宝坤顺丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "清心牛黄片的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '清心牛黄片' }) return n.specifications;"
    },
    {
        "instruction": "六灵丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '六灵丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "朱砂安神丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '朱砂安神丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "我想了解一下牛黄清心丸（局方）的作用，还有哪些药品在这方面表现相似？",
        "input": "",
        "output": "match (n:药品 { name: '牛黄清心丸（局方）' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": " 礞石滚痰丸的主要成分包括哪些药材？",
        "input": "",
        "output": "match (n:药品 {name: '礞石滚痰丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "请阐述一下槟榔四消片的药品功效，同类药品中有哪些也是这样的效果？",
        "input": "",
        "output": "match (n:药品 { name: '槟榔四消片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "我想了解藿香正气片的特性，请给予详细介绍。",
        "input": "",
        "output": "match (n:药品 { name: '藿香正气片' }) return n.character;"
    },
    {
        "instruction": "请提供脏连丸的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '脏连丸' }) return n.specifications;"
    },
    {
        "instruction": "关于桑菊感冒颗粒，我需要你提供其详细特征信息。",
        "input": "",
        "output": "match (n:药品 { name: '桑菊感冒颗粒' }) return n.character;"
    },
    {
        "instruction": "请提供关于得生片的详细特征描述。",
        "input": "",
        "output": "match (n:药品 { name: '得生片' }) return n.character;"
    },
    {
        "instruction": "开胸顺气丸的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '开胸顺气丸' }) return n.character;"
    },
    {
        "instruction": "复方半夏止咳糖浆的主要成分包含哪些药材？",
        "input": "",
        "output": "match (n:药品 {name: '复方半夏止咳糖浆'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "我想了解一下清胃黄连片的作用，同时能否列举一些具有相似药效的药品名字？",
        "input": "",
        "output": "match (n:药品 { name: '清胃黄连片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否给出更年安片的特征描述？",
        "input": "",
        "output": "match (n:药品 { name: '更年安片' }) return n.character;"
    },
    {
        "instruction": "能详细说一下大黄䗪虫丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '大黄䗪虫丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "提供艾附暖宫丸的全面资讯：",
        "input": "",
        "output": "match (n:药品  { name: '艾附暖宫丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能详细说一下京万红痔疮膏的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '京万红痔疮膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "给出十味玉泉片的详细特征",
        "input": "",
        "output": "match (n:药品 { name: '十味玉泉片' }) return n.character;"
    },
    {
        "instruction": "周氏回生丸的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '周氏回生丸' }) return n.character;"
    },
    {
        "instruction": "讨论一下益肺清化膏的功效，还有其他哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '益肺清化膏' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请问能否提供关于女金丸的详细信息？",
        "input": "",
        "output": "match (n:药品  { name: '女金丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "讨论一下左金丸的药品功效，还有其他哪些药品有类似效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '左金丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "描述一下脉络通的特性信息",
        "input": "",
        "output": "match (n:药品 { name: '脉络通' }) return n.character;"
    },
    {
        "instruction": "我想了解橘红丸的特性信息，请给我总结一下。",
        "input": "",
        "output": "match (n:药品 { name: '橘红丸' }) return n.character;"
    },
    {
        "instruction": "清宁丸的特征信息如下：",
        "input": "",
        "output": "match (n:药品 { name: '清宁丸' }) return n.character;"
    },
    {
        "instruction": "能否阐述一下通脉养心口服液药品的功效？类似效果的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '通脉养心口服液' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "全面阐述豨桐丸的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '豨桐丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "防风通圣丸的特性信息需要列举。",
        "input": "",
        "output": "match (n:药品 { name: '防风通圣丸' }) return n.character;"
    },
    {
        "instruction": "请提供补心片的详细特性描述。",
        "input": "",
        "output": "match (n:药品 { name: '补心片' }) return n.character;"
    },
    {
        "instruction": "参茸卫生丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '参茸卫生丸' }) return n.specifications;"
    },
    {
        "instruction": "特征信息如下：华山参滴丸",
        "input": "",
        "output": "match (n:药品 { name: '华山参滴丸' }) return n.character;"
    },
    {
        "instruction": "请谨记香砂六君丸的禁忌事项",
        "input": "",
        "output": "match (n:药品 { name: '香砂六君丸' }) return n.note;"
    },
    {
        "instruction": "请问乌金丸的详细信息是什么？",
        "input": "",
        "output": "match (n:药品  { name: '乌金丸' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "获取完整的7条药材数据信息",
        "input": "",
        "output": "match (n:药材) return n limit 7;"
    },
    {
        "instruction": "请介绍一下通脉养心口服液的主要作用，另外，有哪些其他药品也有类似的功能呢？",
        "input": "",
        "output": "match (n:药品 { name: '通脉养心口服液' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "安神补气丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '安神补气丸' }) return n.specifications;"
    },
    {
        "instruction": "脉安颗粒的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '脉安颗粒'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "能详细说一下小儿清解颗粒的主要作用吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '小儿清解颗粒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否介绍一下得生丸的功效？类似作用的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '得生丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请描述一下止嗽定喘片的主要作用，还有其他哪些药品有类似效果？",
        "input": "",
        "output": "match (n:药品 { name: '止嗽定喘片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "开胸消食片的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '开胸消食片' }) return n.specifications;"
    },
    {
        "instruction": "请查收香砂养胃丸的特性信息：",
        "input": "",
        "output": "match (n:药品 { name: '香砂养胃丸' }) return n.character;"
    },
    {
        "instruction": "禁忌事项是牛黄上清片需要注意的点",
        "input": "",
        "output": "match (n:药品 { name: '牛黄上清片' }) return n.taboo;"
    },
    {
        "instruction": "禁忌事项为明目蒺藜丸的重要内容，需要详细了解。",
        "input": "",
        "output": "match (n:药品 { name: '明目蒺藜丸' }) return n.taboo;"
    },
    {
        "instruction": "全面介绍愈风宁心片的相关内容",
        "input": "",
        "output": "match (n:药品  { name: '愈风宁心片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能否给出六经头痛片的特性描述？",
        "input": "",
        "output": "match (n:药品 { name: '六经头痛片' }) return n.character;"
    },
    {
        "instruction": "能否介绍一下泻痢固肠片的药效？类似效果的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '泻痢固肠片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "包含辅料的痹祺胶囊",
        "input": "",
        "output": "match (n:药品 { name: '痹祺胶囊' })-[r:辅料]->(m) return m; "
    },
    {
        "instruction": "我想了解白带丸的特性信息，可以告诉我吗？",
        "input": "",
        "output": "match (n:药品 { name: '白带丸' }) return n.character;"
    },
    {
        "instruction": "开胸顺气丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '开胸顺气丸' }) return n.specifications;"
    },
    {
        "instruction": "能否给出牛黄噙化丸的特征性信息概览？",
        "input": "",
        "output": "match (n:药品 { name: '牛黄噙化丸' }) return n.character;"
    },
    {
        "instruction": "请问对于心前区的刺痛，有什么药物可以建议使用？",
        "input": "",
        "output": "match (n:药品)-[r:适应症状]->(m :症状 { name : '心前区刺痛' }) return   n ;"
    },
    {
        "instruction": "请问烂积丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '烂积丸' }) return n.specifications;"
    },
    {
        "instruction": "良附丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '良附丸' }) return n.specifications;"
    },
    {
        "instruction": "追风片的禁忌事项有哪些？",
        "input": "",
        "output": "match (n:药品 { name: '追风片' }) return n.taboo;"
    },
    {
        "instruction": "注意事项请给出牛黄抱龙丸的",
        "input": "",
        "output": "match (n:药品 { name: '牛黄抱龙丸' }) return n.note;"
    },
    {
        "instruction": "济坤丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '济坤丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "补肾益脑胶囊的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '补肾益脑胶囊' }) return n.specifications;"
    },
    {
        "instruction": "请提供风油精的包装尺寸信息",
        "input": "",
        "output": "match (n:药品 { name: '风油精' }) return n.specifications;"
    },
    {
        "instruction": "清胃黄连丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '清胃黄连丸' }) return n.specifications;"
    },
    {
        "instruction": "请问梅花点舌丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '梅花点舌丸' }) return n.specifications;"
    },
    {
        "instruction": "请阐述一下热毒平颗粒的主要作用，另外，有哪些其他药品也有类似的功能呢？",
        "input": "",
        "output": "match (n:药品 { name: '热毒平颗粒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "全面介绍金芪降糖片的内容",
        "input": "",
        "output": "match (n:药品  { name: '金芪降糖片' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "伤科壮骨膏的主要成分包含哪些药材？",
        "input": "",
        "output": "match (n:药品 {name: '伤科壮骨膏'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "我想了解益肺清化膏的包装规格是多少",
        "input": "",
        "output": "match (n:药品 { name: '益肺清化膏' }) return n.specifications;"
    },
    {
        "instruction": "请参考以下止嗽青果丸的特性信息：",
        "input": "",
        "output": "match (n:药品 { name: '止嗽青果丸' }) return n.character;"
    },
    {
        "instruction": "能详细说一下复方灵芝颗粒的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '复方灵芝颗粒' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "列出风湿关节炎片的禁忌事项",
        "input": "",
        "output": "match (n:药品 { name: '风湿关节炎片' }) return n.taboo;"
    },
    {
        "instruction": "百补增力丸的主要成分是什么药材？",
        "input": "",
        "output": "match (n:药品 {name: '百补增力丸'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "请告诉我益肾灵颗粒的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '益肾灵颗粒' }) return n.specifications;"
    },
    {
        "instruction": "请问血脂宁丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '血脂宁丸' }) return n.specifications;"
    },
    {
        "instruction": "请说明橡皮生肌膏的禁用事项",
        "input": "",
        "output": "match (n:药品 { name: '橡皮生肌膏' }) return n.taboo;"
    },
    {
        "instruction": "请提供京万红痔疮膏的详细特性。",
        "input": "",
        "output": "match (n:药品 { name: '京万红痔疮膏' }) return n.character;"
    },
    {
        "instruction": "请介绍一下二母安嗽糖浆的主要效果，另外，有哪些其他药品也有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '二母安嗽糖浆' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "哪些药品可以使用桃胶作为成分？",
        "input": "",
        "output": "match (n:药品)-[r:辅料成分]->(m :辅料 { name : '桃胶' }) return n;"
    },
    {
        "instruction": "能详细说一下附子理中丸的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '附子理中丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "对于黄连羊肝丸的使用，需要注意以下事项：",
        "input": "",
        "output": "match (n:药品 { name: '黄连羊肝丸' }) return n.note;"
    },
    {
        "instruction": "请阐述一下小儿消食健胃丸的主要作用，同时给出其他具有类似功能的药品名。",
        "input": "",
        "output": "match (n:药品 { name: '小儿消食健胃丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请阐述肺安片药品的作用，并列举几个具有相似效果的药品。",
        "input": "",
        "output": "match (n:药品 { name: '肺安片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "讨论一下小儿消食健胃丸的疗效，还有其他哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '小儿消食健胃丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能详细说一下长城感冒片的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '长城感冒片' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "阐述得生片的禁用情况",
        "input": "",
        "output": "match (n:药品 { name: '得生片' }) return n.taboo;"
    },
    {
        "instruction": "请提供关于通脉颗粒的详细特征。",
        "input": "",
        "output": "match (n:药品 { name: '通脉颗粒' }) return n.character;"
    },
    {
        "instruction": "阳和解凝膏的全部详情是什么",
        "input": "",
        "output": "match (n:药品  { name: '阳和解凝膏' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "跌打片的主要成分包括哪些药材？",
        "input": "",
        "output": "match (n:药品 {name: '跌打片'} )-[r:主要成分]->(m: 药材 ) return  m"
    },
    {
        "instruction": "禁忌事项对于橘红化痰丸是重要的信息，需要明确了解。",
        "input": "",
        "output": "match (n:药品 { name: '橘红化痰丸' }) return n.taboo;"
    },
    {
        "instruction": "我想了解凉血祛风糖浆的包装情况，能否告知其规格？",
        "input": "",
        "output": "match (n:药品 { name: '凉血祛风糖浆' }) return n.specifications;"
    },
    {
        "instruction": "注意事项是针对龙胆泻肝丸的使用而提出的提示。",
        "input": "",
        "output": "match (n:药品 { name: '龙胆泻肝丸' }) return n.note;"
    },
    {
        "instruction": "请提供十香暖脐膏的包装信息",
        "input": "",
        "output": "match (n:药品 { name: '十香暖脐膏' }) return n.specifications;"
    },
    {
        "instruction": "催乳丸的包装规格是多少？",
        "input": "",
        "output": "match (n:药品 { name: '催乳丸' }) return n.specifications;"
    },
    {
        "instruction": "豨签草可用于哪些药品？",
        "input": "",
        "output": "match (n:药品 )-[r:主要成分]->(m {name: '豨签草'} ) return  n"
    },
    {
        "instruction": "九气拈痛丸的详细特性包括：",
        "input": "",
        "output": "match (n:药品 { name: '九气拈痛丸' }) return n.character;"
    },
    {
        "instruction": "请描述一下喉痛丸的主要作用，另外还有哪些药品在这方面有相似效果？",
        "input": "",
        "output": "match (n:药品 { name: '喉痛丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "禁忌事项是万氏牛黄清心丸的重要内容，需要详细了解。",
        "input": "",
        "output": "match (n:药品 { name: '万氏牛黄清心丸' }) return n.taboo;"
    },
    {
        "instruction": "请提供关于藿香正气水的详细特性描述。",
        "input": "",
        "output": "match (n:药品 { name: '藿香正气水' }) return n.character;"
    },
    {
        "instruction": "注意事项请给出洋参保肺丸的",
        "input": "",
        "output": "match (n:药品 { name: '洋参保肺丸' }) return n.note;"
    },
    {
        "instruction": "提供竹沥水的全面信息。",
        "input": "",
        "output": "match (n:药品  { name: '竹沥水' }) return n.name,n.package,n.note,n.specifications,n.taboo,n.useMethod;"
    },
    {
        "instruction": "能告诉我通宣理肺丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '通宣理肺丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请介绍一下六味地黄胶囊的主要作用，另外还有哪些药品具有类似的功能呢？",
        "input": "",
        "output": "match (n:药品 { name: '六味地黄胶囊' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "清咽滴丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '清咽滴丸' }) return n.specifications;"
    },
    {
        "instruction": "能详细说一下人参再造丸的药效吗？还有哪些药品有类似的效果呢？",
        "input": "",
        "output": "match (n:药品 { name: '人参再造丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "查看复方蟾酥丸时，请注意相关注意事项。",
        "input": "",
        "output": "match (n:药品 { name: '复方蟾酥丸' }) return n.note;"
    },
    {
        "instruction": "羚羊感冒胶囊有什么治疗效果？类似功效的药品有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '羚羊感冒胶囊' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否给出藿香正气颗粒的特征描述？",
        "input": "",
        "output": "match (n:药品 { name: '藿香正气颗粒' }) return n.character;"
    },
    {
        "instruction": "能详细说一下二妙丸的功效吗？还有哪些药品有类似的作用？",
        "input": "",
        "output": "match (n:药品 { name: '二妙丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "能否分享一下黑锡丹药品的疗效？还有没有其他药品在这方面表现相似？",
        "input": "",
        "output": "match (n:药品 { name: '黑锡丹' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    },
    {
        "instruction": "请问得生丸的包装规格是什么？",
        "input": "",
        "output": "match (n:药品 { name: '得生丸' }) return n.specifications;"
    },
    {
        "instruction": "玄归滴丸内含的辅料有：",
        "input": "",
        "output": "match (n:药品 { name: '玄归滴丸' })-[r:辅料]->(m) return m; "
    },
    {
        "instruction": "禁忌症包括对槟榔四消片过敏者，孕妇，哺乳期妇女，儿童和青少年，以及有严重肝肾疾病或心脏病的患者。",
        "input": "",
        "output": "match (n:药品 { name: '槟榔四消片' }) return n.taboo;"
    },
    {
        "instruction": "能否阐述一下五淋丸的药品功效？类似功效的药品还有哪些呢？",
        "input": "",
        "output": "match (n:药品 { name: '分清五淋丸' })-[r:作用功效]->(m)  optional match  (m)<-[r2:作用功效]-(m1) return m,m1;"
    }
]